[
    {
        "Product Index": 1,
        "Product Data": {
            "Product Name": "PlayStation 5 Console -  Marvel’s Spider-Man 2 Bundle (slim)",
            "Product Price": "499",
            "Product Rating": "4.5",
            "Product Number of Rates": "611 ratings",
            "Product Image Address": "https://m.media-amazon.com/images/I/61INHIveEIL._SX522_.jpg",
            "Product Description": " Bundle includes Marvel’s Spider-Man 2 full game digital voucher Slim Design - With PS5, players get powerful gaming technology packed inside a sleek and compact console design. 1TB of Storage -  Keep your favorite games ready and waiting for you to jump in and play with 1TB of SSD storage built in. Box Contents - 1 DualSense Wireless Controller, 2 Horizontal Stand Feet, HDMI Cable, AC Power Cord, USB cable, printed materials, ASTRO’s PLAYROOM (Pre-installed game) PS5 console (CFI-2000 model group – slim). Vertical Stand sold separately. ",
            "Product Reviews": {
                "1": "Pros:\n\nRendimiento potente: La PlayStation 5 cuenta con un procesador AMD Zen 2 y una GPU AMD RDNA 2, lo que le permite ofrecer una experiencia de juego de última generación con gráficos impresionantes y tiempos de carga rápidos.\nCompatibilidad con versiones anteriores: La PlayStation 5 es compatible con la mayoría de los juegos de PlayStation 4, lo que le permite disfrutar de una biblioteca de juegos más amplia.\nControles DualSense: Los controles DualSense de la PlayStation 5 ofrecen una experiencia de juego más inmersiva gracias a las funciones de retroalimentación háptica y gatillos adaptativos.\nJuegos exclusivos de PlayStation: La PlayStation 5 ofrece una variedad de juegos exclusivos de alta calidad, como Marvel's Spider-Man 2, God of War: Ragnarok y Horizon Forbidden West.\nContras:\n\nPrecio elevado: La PlayStation 5 es una consola de gama alta, por lo que su precio puede ser elevado para algunos usuarios.\nEscasez: La PlayStation 5 ha sido difícil de encontrar desde su lanzamiento, debido a la escasez de componentes.\nConclusiones:\n\nLa PlayStation 5 es una consola de juegos de última generación que ofrece un rendimiento potente, una amplia biblioteca de juegos y una experiencia de juego inmersiva. Sin embargo, su precio elevado y la escasez de unidades pueden ser factores disuasorios para algunos usuarios.",
                "2": "",
                "3": "By pure accident, this arrived 8 years to the day after I bought my PS4.\n\n8 years is a pretty good run for a console, but I figured it was time to upgrade, and I've been quite pleased with the results.\n\nUp front, the bad: the slim has a bit more storage than the \"fat\" PS5 but I worry that I'll quickly run out of space. And that's it. That's the extent of my cons list.\n\nThe good: outrageously quicker load times. I've been playing a lot of Fallout 76. On my PS4, it would routinely take upwards of 45 seconds to \"fast\" travel. I got in the habit of grabbing the phone and scrolling social media while it loaded. On the PS5, it's more like 10 seconds, tops. Usually much less.\n\nI've also been playing the new(ish) God of War and load times are almost immediate. It's uncanny.\n\nI've got an older TV (probably 2012) and even still, the graphics are a significant step forward.\n\nUltimately, it's everything I loved about my PS4, except better. There's not a single area where I feel like they took a step back except in storage...I had a 1 TB Black Ops 3 edition and would have liked the PS5 to beat that without resorting to aftermarket help.\n\nOtherwise, the controller feels better in my hands and has some cool bells and whistles (integrated mic, multi-function giant button, etc.), the load times are vastly improved with the SSD, and the games look better and run better.",
                "4": "The PS5 box was fresh, still had the little tape seal at the top, the Call of duty MW3 Voucher was in there and does work. The only thing I didn’t like was the Amazon box they put the PS5 box in didn’t have a lot of cushion to protect it, but I mean the PS5 box already protects the PS5 pretty well.\n\nI also would recommend putting very specific instructions on how to find your address as they accidentally delivered it to my neighbors even if you live in a house and not an apartment just something to better identify your home.",
                "5": "I could be wrong but I think the picture looks better than the old one. It’s a good buy if you don’t have one. The smaller one is OK. I had the older version and it’s noticeably smaller but not worth it if you own one. AS FOR COD MW3: Pay attention to your essential schedule. I’ve lost hours to his game because its just so good. It looks good and takes advantage of HDR. So many different available things to do but for sure activision is trying to figure out how to get their money out of you. A good bundle.",
                "6": "The whole bundle came as advertised a brand new slim 2023 ps5 model with the removable disc drive, none of the marketing or descriptions disclosed that so i wasnt sure if this was the first model of ps5 or the new slim model that you can attach a disc derive to and it is indeed the new model with a modular drive. Copy of Spiderman 2 came with it as well as a download code, thats y only real \"comlaint\" i wish it was a game case with a disc but you cant complain for the price of the bundle you get a new revised slim version of the ps5 and a new game with it, i love the feel of the ps5 controller its way better than the ps4 controller. Biggest thing i've noticed is the console is absolutly silent to the point i have forgotten it was even on because my PC fans on low are louder than it. Overall a great console and a great bundle if you've been waiting to upgrade from ps4 as i have, this is the time you should take that chance to upgrade and now i can take full advantage of my 120hz 4K moniter so all in all this was a perfect bundle to buy as an early christmas present for yourself or someone else who's wanted to upgrade to the next generation consoles.",
                "7": "This System(PlayStation 5) Was Everything I Expected It To Be, The Design Of It 10/10!!! Plus It Has The Ability To Detach The The Protective Covers To Change Them With Decorative Styles That Are Available Or Customized Personal Ones, Furthermore The Fact That Sony Has Made These Next Gen Consoles More User Friendly As To Interchangeable Internal Components Upgrade Ability Is An Absolute Plus!!! Also A Huge Thanks To The Amazon Team For The Safety Of Transported Goods, (Speaking For Self Of Course) As A Customer I Find That To Show Great Professionalism In The Individual(s) Who Deliver The Products!, Packages Them, And Stages Them For Processing!",
                "8": "It came in safe and all the wires i needed came with it, the controller as well. The ps5 itself is incredible, the graphics look amazing for such a tiny console, it’s easy to setup and sign into or create an account and the ps plus game pass thing is a good deal. I recommend this to anyone who wants to get a cheap and good console. God of War Ragnarok looks amazing btw",
                "9": "ahh the crisp new smell of a game console. delvered mostly well (aside from the box being a little rough, and i'm pretty sure i heard the carrier drop the damn thing down on the ground delivering it here). all seems to work well, no scratches, no problems so far. a little concerned about the controller, the toggle's a little strange and the vibration makes a whirring noise but what do i know, maybe it just needs worked in a little. high-five.",
                "10": "",
                "11": "",
                "12": " I bought this console for my wife's birthday because she saw it at Costco. Fortunately, her birthday is around Black Friday so Amazon had it on somewhat of a sale with Spider-Man. Few days later, it got delivered but we had a one week trip to Spain planned and she didn't get to open it. Sad face. The whole trip she kept talking about how excited she was to get back and setup the console to play. I literally married a child. Fast forward one week, we get back and the first thing she does is set up the ps5. According to her, the setup process was fairly easy. One thing we noticed is that the screen reader is default set to on. This was a bit annoying when you didn't expect it to be defaulted to on. A quick google search showed us how to disable it. Game play is super duper smooth but you need to make sure your HDMI cable is up to date as we originally used one from 2010 so the resolution was stuck at 1080. Graphics have come such a long way from my Xbox 360 days. Spider-Man's story line is fun to play along to and quite challenging. Wife is super happy that she has the ps5 now but I'm worried we're going to be spending a lot of money on games now. But, you know what they say, happy wife... (and that's it)",
                "13": "I bought this for my husband’s birthday. I’ve heard all the horror stories of PS5’s over heating and this is perfect. Let’s just say by his reaction I did a good job. He also has a place for his oculus 2 now!! Keeps it cool and his , we’re happy 😃"
            }
        }
    },
    {
        "Product Index": 2,
        "Product Data": {
            "Product Name": "Meta Quest 2 — Advanced All-In-One Virtual Reality Headset — 128 GB",
            "Product Price": "249",
            "Product Rating": "4.7",
            "Product Number of Rates": "67,680 ratings",
            "Product Image Address": "https://m.media-amazon.com/images/I/61tE7IcuLmL._AC_SY355_.jpg",
            "Product Description": "Brand Meta Quest Color White Connectivity Technology Wi-Fi Included Components Quick Start Guide, Power Adapter (US, UK, EU, AU), Glass Spacer, 2 AA Batteries, Safety & Warranty Guide, Charging cabl… See more Compatible Devices Smartphone Model Name 899-00187-02 Product Dimensions 10.24\"D x 7.36\"W x 4.96\"H Operating System Oculus Field Of View 360 Connector Type USB Type C  Experience total immersion with 3D positional audio, hand tracking and easy-to-use controllers working together to make virtual worlds feel real. Explore an expanding universe of over 500 titles across gaming, fitness, social/multiplayer and entertainment, including exclusive releases and totally unique VR experiences. Enjoy fast, smooth gameplay and immersive graphics as high-speed action unfolds around you with a fast processor and immersive graphics. Travel universes in blockbuster fantasies, scare yourself witless in horror adventures or squad up with friends to save the universe. Come together in incredible social spaces and multiplayer arenas as you take in live events with friends and family, find your new workout crew or join adventures with fellow players. Be truly free to explore in VR With a wireless headset, intuitive controls, a built-in battery, easy setup and no PC or console needed. Play without worries by setting your designated play space and get alerts if you move outside it. ",
            "Product Reviews": {
                "1": "First, a little background. I'm 73 years old. Above average in the activity department, adept mentally, although I am literally the only person I know who can lose something when standing perfectly still. I have four grandchildren. I hold down a full-time job as a writer, and a once-a-year gig teaching Rio Grande Board Games at the annual World Boardgaming Championships (WBC).\nIt was at the most recent WBC that I was introduced to MetaQuest 2 and in particular, its bundled game called Beat Saber. I'd tried much cheaper VR systems, the ones that hold your phone and you have to download apps to run on them. This was an entirely different ball game. This was, I should note, not a function of the WBC. It just so happened that one of the site administrators had brought the system along with him and one evening, invited me to give it a try.\nThe first issue that one should note is that once you put the headset for this system on, you are pretty much detached from the reality around you. This is fine as long as it's just you and the machine, but you can forget about being outside the machine and trying to instruct someone inside the machine about what's going on. As it happened, the man who introduced me to the system basically set it up for me - put it on his own head, clicked the right buttons - and then transferred the headset to me. With a couple of hand prompts and a word or two, Beat Saber, the program that comes with the MetaQuest 2 when you buy it these days, came on line and there I stood, with two controllers, one in each hand, as my eyes beheld on the screen in front of me, a series of square blocks coming at me, each with an arrow, pointing either up, down, right or left. The controllers operate two light sabers, one in each hand, and the object of this game is to swat the approaching blocks in the direction indicated by the arrow on them. There are also occasional large obstacles coming at you, like skinny walls, which appear like three-dimensional line drawings as they approach. You can't swat these aside and the idea is to avoid them. In most cases, this entails just stepping out of their way, either to the right or the left, but dependent on some choices you make in Beat Saber, some of these objects can be wide and impossible to avoid unless you duck as they approach. No way to jump over them.\nAnd there's music. At first, you don't pick up on the idea that your swatting activity with the light sabers can occasionally be rhythmic, linked to the beat of the music. . .Beat Saber. Get it? But you'll pick up on that fairly quickly. If you don't dance and would like to, this is a good program that will force-feed you the concept of moving your body in beat with the rhythm of a song. You don't realize you're dancing because as far as you're concerned, you're swatting colored boxes with virtual reality light sabers. A note of caution. People familiar with the system and how it works will delight in recording video of your attempts to play the game; unbeknowst to you, 'cause you're wrapped up in the headset and can't see anything but what the machine is giving you to see. These people recording you will be LOL-ing themselves breathless, as you contort yourself in a relatively confined space, trying to dodge things and swat at the colored boxes.\nI made the mistake of failing to heed the warning that if I didn't buy one of these systems soon, its price was going to go up. A lot. And it did. But I bought it anyway and am just beginning to tap into the available free apps and exploring the possibility of buying other ones.\nThere's a free Epic Roller Coaster app, which is fairly enjoyable, although oddly enough, both myself and my wife (now at home with our own MetaQuest 2) found ourselves getting a little queasy during the experience. Not sure what that's about. She NEVER goes on real roller coasters and I do it all the time.\nAlso found a walking-on-a-building-skeleton app that had me God knows how many stories high and though not generally afraid of heights (acrophobia), I wasn't all that keen on walking on the available, skinny steel walkways to approach the edge. I'm in my living room, my mind knowing damn full well that I'm not only not as high as the program makes me think I am, but am, in fact, on solid ground. Yet, in an attempt to approach the edge and have a look OVER the edge, I am literally creeping forward, edging my foot out in front of me, making sure of my balance with each step. My mind absolutely refuses to grasp the concept that I am not in any danger.\nIt should be noted that when you play in virtual reality, the mechanism has you define a space where you are going to be, literally drawing a perimeter line. It's not because the machine is worried you might step off the big building you only think you're on, but when you're playing a game like Beat Saber, you want to make sure that your arm movements don't knock over a lamp your Aunt Ethel gave you for Christmas last year, or in moving your legs around, you don't accidentally kick the screen out of your new Smart TV.\nI haven't been too excited by any of the first-person shooter kind of apps that are available. That kind of activity never lured me to the various systems that were already on the market. But I did notice and have been on the verge of pulling the trigger on some of the other activities, like table tennis, actual tennis and some other sports activities, like baseball. Am also interested in what is, at present, a small selection of board games, like Tsuro and chess (in a variety of different environments). They offer Catan (originally, Settlers of Catan) and though my interest in board games is strong, I never really liked Catan in real-time, so I'm not going to pick it up in VR.\nI recommend this system highly. The experience of good VR (and you can buy systems better than the basic one that I purchased) is mind-altering. It's something to which your mind has never been previously exposed; an alternate reality with its own set of rules that takes some getting used to. It's more expensive than pot, but unlike pot, it doesn't just let your head create new connections and free it from everyday anxieties, it creates a reality within your brain that is intriguing to watch, hear and interact with.\nAnd as my age indicates, fun for all ages.\nOh, and one other cautionary note for those of a certain advanced age. The first time I tried the system, at the WBC, my score at Beat Saber was abysmally low. So I tried again. And again. It wasn't my hand movements with the controllers or the side-stepping away from approaching objects that got to me. It was the ducking at things that I had to let go over my head. I made the crouching moves necessary with reckless abandon. Once, again, and again. My upper thighs complained to me all of the next day. The good news is that it makes for good, healthy exercise.",
                "2": "I just finished a rather challenging online degree program the other day and decided I owed myself a little something to celebrate. I had just enough cash to buy one of these and thought I’d see if it was all I’d hoped it might be. Holy freakin’ crap!\n\nI was lucky enough to have a little spare cash on hand so to celebrate finishing my classes I bought myself a MetaQuest 2 VR headset package from Amazon. I did the initial set up tonight which was itself amazing. I have a virtual home that’s my startup lobby for everything and my home is on a space station complete with huge windows with a bright nebula outside and shuttles flying past docking at the station. When I need to access any menus etc., a window just opens up in the air in front of me and with my bare hands I can just tap any commands or instructions I want onto it and it whisks me away to wherever I’ve instructed it.\n\nAfter setting it up I finally gave a shot to my first free, fairly rudimentary game which is pretty much a first-person shooter game. When it loaded up I was in awe as I found myself standing on a high pedestal inside a gigantic flaming stadium where a fleet of mean looking drones start opening fire on me from every direction. I can see I have guns in my hands that are like blasters from Star Wars and I have to shoot down these attacking drones while I’m spinning in circles trying to pick my targets, and not fall off the pedestal while I’m firing a barrage of neon pink energy bolts at them. At one point I found myself with each arm outstretched straight out to my left and right sides and was just twirling in a circle firing while spinning and just found myself giggling like a little kid. I’m really stunned at how real it all looks and feels when that headset is on my face. I didn’t really think it would be that good, that all-consuming, or that real. I literally felt like I was inside a real-world sci-fi movie and it was incredible!\n\nBest thing is this little toy is also a very good piece of workout equipment. There are a ton of apps out there like Supernatural VR that have you constantly punching flaming meteors coming at you while having to jump over obstacles, squat down to keep from having your head knocked off and can get you sweating, wiped out and sore in just a few minutes. I can see this is going to be something I’ll be using like crazy.\n\nTonight I’m going to try watching a movie on it. Apparently one of the apps I downloaded will play from my Netflix account, and put me inside a movie theater with seats, and lit aisles and the movie on a huge screen right in front of me. Really remarkable. I was excited to try one of these out and it turns out it’s even better that I imagined. Best little toy I’ve bought myself in years.\n\nI did the initial set up tonight which was itself amazing. I have a virtual home that’s my startup lobby for everything and my home is on a space station complete with huge windows with a bright nebula outside and shuttles flying past docking at the station. When I need to access any menus etc., a window just opens up in the air in front of me and with my bare hands I can just tap any commands or instructions I want onto it and it whisks me away to wherever I’ve instructed it.\n\nAfter setting it up I finally gave a shot to my first free, fairly rudimentary game which is pretty much a first-person shooter game. When it loaded up I was in awe as I found myself standing on a high pedestal inside a gigantic flaming stadium where a fleet of mean looking drones start opening fire on me from every direction. I can see I have guns in my hands that are like blasters from Star Wars and I have to shoot down these attacking drones while I’m spinning in circles trying to pick my targets, and not fall off the pedestal as I’m firing a barrage of neon pink energy bolts at them. At one point I found myself with each arm outstretched straight out to my left and right sides and was just twirling in a circle firing while spinning and just found myself giggling like a little kid. I’m really stunned at how real it all looks and feels when that headset is on my face. I didn’t really think it would be that good, that all-consuming, or that realistic. I literally felt like I was inside a real-world sci-fi movie and it was incredible!\n\nBest thing is this little toy is also a very good piece of workout equipment. There are a ton of apps out there like Supernatural VR that have you constantly punching flaming meteors coming at you while having to jump over obstacles, squat down to keep from having your head knocked off and can get you sweating, wiped out and sore in just a few minutes. I can see this is going to be something I’ll be using like crazy.\n\nTonight I’m going to try watching a movie on it. Apparently one of the apps I downloaded will play from my Netflix account, and put me inside a movie theater with seats, and lit aisles and the movie on a huge screen right in front of me. Really remarkable. I was excited to try one of these out and it turns out it’s even better that I imagined. Best little toy I’ve bought myself in years.",
                "3": "I purchased this during the Black Friday sale, so it was $200 after credits, which was a fantastic deal, so that factors into my review.\n\nAs someone who has never used a VR headset before, but has been curious about it for a few years, this has been a fun experience so far. It can work as a standalone platform, or you can use it to connect to a PC and play VR games that way. I've seen other people complain that the straps on the headset are uncomfortable, but I haven't had any issues with them.\n\nReally, my only issues with the Quest 2 are as follows:\n\n(1) Some games seem to make me feel nauseated (Rec Room is the worst offender so far), which isn't helped by the headset getting a bit warm after awhile. I was expected a bit of disorientation, but as I generally don't get motion sick, this was somewhat surprising to me. There are some settings that can be tweaked (especially sitting vs. standing), so I plan to try that out on certain games to see if it helps.\n\n(2) Meta's history of privacy issues.\n\n(3) The AR cameras are black-and-white and kind of meh quality, so this isn't really viable for any sort of AR applications, which is admittedly a very minor complaint.\n\n(4) The battery life seems a bit on the short side.\n\nOverall, for $200 (or even $250), this is a fantastic device for someone looking to get into VR. It's versatile, can be used for a wide variety of games and applications, and has been a ton of fun to use so far.",
                "4": "I bought this to make sure I stayed active in my retirement years. Easy to use. Realistic beyond belief. If you wear glasses, make sure you put in the glasses spacer. You can do this by removing the black rubber around the perimeter of the mask. Start at the nose and pull up. Put in the spacer, then reattach the rubber. Makes a big difference. Favorite games are Beat Saber, 7th Guest, and the Jig saw puzzles. First time on 3D puzzles. Amazing.\n\nStop before you get tired, otherwise you might find yourself trying to lean against the realistic tables to rest a minute (7th Guest). You won't do it more than once! They're not really there! Have fun.",
                "5": "THIS IS FOR MY SON, HE HAD ONE AND IT BROKE... GOT HIM A NEW ONE... ONLY COMPLAINT WOULD BE THE VR IT SELF IS SMALLER AND SEEMS TO BE TIGHT AROUND THE HEAD PART.... WE COMPARED TEH OLD ONE AND NEW ONE AND IT IS INDEED A TAD SMALLER.... WE DID GET THE BATTERY ADD ON THIS TIME, AND THAT IS GREAT!!! WORKS WELL, AND BATTERY ADD ON IS GREAT.. KEEP IN MIND IF YOU HAVE HAD ONE BEFORE, AND BUY A NEW VR 2 IT IS THE SAME, BUT IS SMALLER...LITTLE TIGHT , NOT SURE WHY THEY WOULD MAKE IT SMALLER. BUT WORKS WELL!! MY SON IS VERY HAPPY!!!",
                "6": "I bought this knowing the Quest 3 was out, but the price was the primary consideration for me at the time. I find this to be better or fit my needs better as I only wanted something for PCVR, and this fits the bill fine if you're seeking out for that experience without paying too much.\n\nWhat are some of the pros? One was that I found the overall setup experience to be seamless and relatively headache free. Second, the controllers and headset feel sturdy and well made, probably meant to withstand accidental scrapes and impacts with objects, cause that will happen regardless if you're careful with your play area. Third is the integration with Steam VR, and you can just play any games in your library from the get-go without any issues as long as you have a cable that supports the bandwidth required, or also charge while playing so you can have an extended session.\n\nThe only con that I have with this headset is the lack of IPD adjustability, which means I have to wear my prescription glasses and attach the spacers if I want to use the headset and not experience any blurriness. The Quest 3 has it built in as standard, but is also $200 over the MSRP of the Quest 2. It's not exactly the biggest drawback honestly, as it can vary from person to person.",
                "7": "At 26, and with a love for all things fun and techy, the Meta Quest 2 has been my latest craze. It's like unwrapping a present every time I put it on—with its vast world of games and immersive design experiences. Just a heads-up from someone who values comfort as much as a spontaneous dance-off: get the Elite Strap. It's the comfort upgrade that lets you play longer, design more, and dive deeper into VR without that 'need-a-break' feeling. Trust me, it's the smart move!",
                "8": "This was the best thing i've ordered in my life. I had tons of fun with it. The only things i dont like is the default headstrap. Its super uncomfortable. But you can always buy a new one, the... elite headstrap.\n\nAlso, the charger had an american outlet shape, so i couldnt stick it anywhere, but i came up with a solution and somehow fused it with one of unused cables that go with my outlet's shape and the charger works perfectly now.",
                "9": "Pros:\n- Fairly Immersive.\n- Amazing experiences.\n- Personal home theater, huge movie screen, made even better with paid Virtual Desktop ($20usd) that gives you actual movie theater vibes and tons of other scenes. Oculus link (Free) does a pretty good job with big screen too.\n- Nice desktop experience in VR through Oculus Link (free)\n- High refresh rates up to 120hz (if you're wired and can find a game that supports it)\n- Haven't seen other views to compare, but I'm very satisfied with the resolution. And hear its better than most if not all other VR headsets right now while also keeping in mind its the most compatible with VR games. Im guessing this is the Playstation or XBOX of Virtual Reality. Or they are lining up to be. Either way, its the right choice for gaming and other.\n- Truly the next level in gaming and virtual spaces like home theater.\n- Gonna list Half Life: Alyx as a pro. Was my first VR experience, and although god-tier amazing, I would suggest working up to it as not much has compared since :P But I am having fun in other games like Boneworks and TWD Saints and Sinners. I like TWD more so far but I have a few gripes with that game. (Not a reflection of this product)\n- As anyone would tell you, works well with streaming services. You got your Netflix Hulu and Disney plus.\n- You can load movies and videos from your pc stored into Oculus directly for trips without wifi.\n\nCons:\n- Good thing I already owned a beasty gaming pc. You're gonna need one for titles like Half Life: Alyx.\n- Battery life. Could not watch a 2hr30min movie without plugging in. Con still offset by the amazing movie theater-like experience. Was using Virtual Desktop so maybe the wifi usage played a part.\n- Real Con, the strap it comes with is uncomfortable and will give you a headache the first week or so.\n- It is heavy on the front and my forehead and cheeks hurt, requiring me to take a break, wash and massage my face every couple of hours, every day. (I've watched videos on how to adjust and not over-tighten but not much can be done about the reality of the situation. It is far from weightless and fairly noticeable.\n-If you need glasses to see things far away, you will need glasses for the VR headset too. Special lens caps cost roughly between $60 and $100USD. But it comes with a spacer. You can likely get away with those retro non-spacer glasses.If they have those little feet that push off the nose you might be in trouble and if they are really big, you might be in trouble so look into the dimensions of the quest 2 view port and your glasses. An annoying extra step but probably worth it.\n-Scuba Diver effect. The view cant be in the pro section. As I said, you'll feel like a scuba diver. Only during the most immersive of times will you not notice too much. To be fair this is.. most of the time.\n- blurring and lens-rings. If not absolutely perfectly centered, you'll get some blurring in various parts of your view. At first and for a few days the little magnification rings of the actual glass piece of the lenses will be very noticeable in your peripheral. Again to be fair.. again, while having an amazing time, you will not notice.\n- Also there's this thing about the lens spacing I hear a lot of people complaining about. I think I'm just at the edge of the farthest setting but could probably do with a tiny bit more. Read other reviews and look into it about I forget what its called, the space between both your pupils.\n- It'll take a few days or more than a week for your mind to ignore some of these, like the rings, occasional blur, and scuba effect.\n-Serious con, be ready to shell out at least another $100usd or so on extras. $19 link cable $16 extension cable plus breakaway protection, Silicone Grips and hand strap (worth it and kind of necessary for throwing objects in comfort,) $30 Rechargeable batteries or a large supply of AA’s. Be sure either are 1.5v. $10-30. Head Strap pad I bought $15 (not compared to $30-50+ or so elite straps. And if you need the prescription lens caps another $60-100. And your first game ranges from $10-40usd or so, for the good stuff.\n- Very few free games/stuff. And not that many AAA amazing titles. (Not exactly a reflection of this particular product)\n-This thing gets sweaty after a few dozen minutes of intense gameplay so have a dry cloth handy and don't get pulled into the ‘pass it on or around after playing beat saber to your friends’ fantasy.\n\nIMO/SideNotes Related to this product directly and VR as a whole:\n- The device should have been a more evenly weight-distributed helmet.\n- I wouldn't expect to game any more than an hour or two without being plugged in either to a power outlet or pc. Mileage may vary.\n- Buy a 10 - 20 ft data cable with your purchase. The provided cable is like 3ft or something. You're gonna need it regardless of pc ownership. Search youtube for good 3rd party brands it should cost around $18-28usd or so for a good cable with decent length.\n- Find your play area and hold your arms out, now plan for an additional one or two feet, mainly North, West and East of you. The Quest 2 comes with a 'Guardian' thats really good at letting you know when you're 'out of bounds' but you will be bending to search or grab stuff reaching and leaning over, tossing things aside (In VR, While stationary, with one or two steps of leeway) make sure you have the space to be swinging your arms around like that. be honest with yourself about this space. If you don't have it, you don't have it. Sorry. I had to rearrange my room a little but luckily I had the space and it was absolutely worth it.\n-VR is very physical. Some games have seated options but require too much leaning and grabbing and searching to do it sitting down. So be ready to stand and crouch and lean. I kept that from both pro’s and cons. IMO, awesome, but be ready for it. Make yourself take breaks every half to sit and stretch if you're not used to standing all day, but not even taking into account the workout apps, this has gotten me burning more calories and keeping my redstuff circulating more and my metabolism on its toes. Actually crouching behind cover is pretty cool but also tiring lol.\n- IMO, Probably not a con, too many older games being remade or re-released in VR. Don't get me wrong, Fallout 4 with Whispering Hills mod was and is mindblowing but after putting in so many hours on the pc version and playing it for years, its kinda hard to get all the way into again. But I guess for kids who never ever played Fallout 4 and they get it for VR, then it’ll be pretty awesome for them. Same for Resident Evil 4 Which I played on the Gamecube, not in VR yet but I fear the novelty will wear off as I played that game like crazy already and it would be a massive retread - even if VR itself is still amazing, I’ll stand by that. (So not a direct reflection of this product)\n-I want to see more completely brand new AAA single player games.\n-I hear GTA San Andreas is coming to VR.. Again, great for kids, but how about a brand new GTA VR?.\n- Only been in the scene a few weeks but, looking back and ahead, it looks like a really lazy and slow march into making VR a thing for everyone. IMO right now it's still more of a niche enthusiast thing. I only say that because I’ve been hearing about VR for years. What did people play on the Quest 1?\n- Get a small rug or mat to stand on, maybe even a towel will do so you know when you're stepping off too far out of bounds. I have a small rug I folded up just enough to fit my feet with a little bit of slack on all sides. This’ll make you more comfortable but will also help keep you stationary and orient you. They sell $100 tough gamer standing pads about the size of the guardian, if you have the dedicated space and money for it, I can't stop you I guess, but a simple, thick rug or small yoga mat will do.\n-Like a baseball plate, add a little point when you draw your guardian space to let you know which way you should be facing at all times, you want that wire mostly behind you at all times.\n\nI have more to say but admittedly this is getting long. I would wait a couple of years until a much lighter and more comfortable VR device comes out. But, if you cannot wait any longer and love gaming or just want what VR has to offer. I can tell you that, it is here, and it is amazing.\n\nSeeing previews of anything VR on a 2D screen cannot do it justice and neither can words, of this you must trust me, you would have to experience it yourself to truly understand. Ask a friend or coworker if they have one and if you can try it. You wont believe it until you do. Or take the plunge like I did. I have my gripes with this thing, and it's not all fairy tales, but I do not regret purchasing it. Like I said before, it really is the next level in gaming, and it really is here.\n\nBe considerate, please. This took a while to write to help you.",
                "10": "So, there are two sides to this product. From a hardware standpoint, I really don't have any complaints. The headset is comfortable enough with one of the better adjustable head straps I've ever seen on any head-worn device. (I recommend wearing a cloth skullcap or even washcloth so that the strap isn't pulling on your hair (a baseball cap won't work), and the towel will collect sweat, although I've yet to sweat in it. There's a learning curve with the controllers, though it's not bad. Be careful, you could easily break them quickly, smashing them into each other, or punching into a wall or objects, though the guardian carrier does work effectively in keeping you from running into things once you set it up, so make sure you set it up properly. This product can NOT be operated in less than an 8ft square space. You may want to own a house with a dedicated room, or have some space in your apt. Don't expect to use this in an apt with no central open space. The audio isn't as good as some newer iphones, but its not bad either, however, I hope sending it out to a stereo is seamless. I have a feeling it won't be. Connecting to the internet was not a problem at all.\n\nMy real issue is I don't feel the browsing of apps and functions is OPTIMAL considering how much fanfare Facebook is blowing about the metaverse. The nav took me a bit to get used to, but then it became fairly logical. The issue is some apps are much better at navigating than others. Having to boot out with the Oculus button varies app to app, and it almost never takes you back to the previous menu which you dove in from. The control console always shows up, but the menu of what you were in doesn't always. Case in point - the tv channel, which includes various travel VR scenes of Paris, Cairo etc. The Paris footage was great, if short, but I tried to boot out of Cairo, and the TV icon became visible, and I clicked on it, and I went right back into the video where I was, NOT to the previous menu of selections. I NEVER got back there, and ended up NOWHERE near where I started. Facebook needs to crack down on those apps not meeting the nav standards, but they prob don't want to lose previous content, which takes some effort to create, it is clear.\n\nYou have to give this time. Some apps will disappoint, others will amaze, and there's no way to predict it, because this is a new sort of medium. The demos are often not adequate to be sure you want to pay for the app, and that can be a bummer, because if you don't like it, you just paid for zippo.\n\nFor instance, one app claimed to be free, then dumped me into a big showroom where you have to buy your weapons. Other apps have demos good enough to make it clear buying the app will be worth it over time. Facebook should do more to demand adequate demos from developers.\n\nAn app like Superhot is phenomenal and makes you happy you bought this. The demo gives you a taste of what the game about, and then the game seems like a good deal, and you've got a satisfying experience. I HIGHLY recommend the ISS space experience downloads if you want to see what floating in orbit is like. It's quite astonishing. The travel experiences make you want to go to those places. The issue is if you don't get into the right apps, you might find yourself saying ho hum.\n\nThe travel TV segments look great if a bit dated. The famous fitness program Supernatural instantly put me into a 14-day trial that will go straight into monthly payments if I don't cancel it. Can't you just show me the program for an hour without getting my payment info? This isn't your iphone where you know iOS is there to protect you. This is Facebook, and yeah, I have a bias towards Apple, and I'm here to tell them that this market is open to take away from Facebook, because they aren't doing it 100% optimally.\n\nAnother problem I have is the utility VR programs that tap into desktop software I want to use that are more specialized work through Steam and the PC. I want the Quest 2 to interface with Apple, and that may not be happening.\n\nI'm not saying that VR isn't a stunning experience, and the physical side is really well figured out. It truly is, but the software side (as often is the case) could be tighter. This is Facebook, and they claim to own this space so they deserve more pointed criticism. The issue is also that VR is a somewhat new medium, so some patience is to be expected. It will take a few tries to get used to the basic operation, and then you can start assessing the apps. However, if you get dud apps before you get used to the operation, you may find it all overrated. I just think Facebook should match their introduction to the physical use of the headset to a good cross section of apps to bring you in further. Echo VR is another app that shows you the potential of the medium once you get into it. However, I'm not really about meeting up with people I don't know to play games. These apps should have single-player options by default. The VR environment instantly puts you into a space where you're making choices, and sometimes you don't like the choices the app you're in has made. You want to do something else.\n\nPeople complain about the interface of the accounts with Facebook. I wasn't crazy about it at first, but you can create multiple profiles under the main one, so it's not the end of the world. Of course, many of the settings have to be reentered from scratch, and so far the apps don't seem to cross across the accounts, so not sure if that's optimal.\n\nAlso, literally ZERO apps come with the console. There are free apps, but you wouldn't know it, since how to find them is NOT immediately apparent (once again, squeezing your own customer instead of being their pal), some of which are more or less lying, and others which are highly boring. You would think Facebook would have the brains to greet new users into their wondrous world by just having a mainstay of 3 seamless good apps for everyone that got you feeling good about the console you just bought.\n\nSo I give it 4 stars for setup of the headset itself, and 2 stars for not really introducing the user properly to a set of apps that shows them the power of the medium overall."
            }
        }
    },
    {
        "Product Index": 3,
        "Product Data": {
            "Product Name": "Xbox Series X 1TB SSD Console - Includes Wireless Controller - Up to 120 frames per second - 16GB RAM 1TB SSD - Experience True 4K Gaming Velocity Architecture",
            "Product Price": null,
            "Product Rating": "4.8",
            "Product Number of Rates": "24,410 ratings",
            "Product Image Address": "https://m.media-amazon.com/images/I/51ojzJk77qL._SX342_.jpg",
            "Product Description": "    ",
            "Product Reviews": {
                "1": "Step into the realm of gaming greatness with the Xbox Series X, the Hercules of consoles – muscular, powerful, and ready to elevate your gaming experience to celestial heights! Assembling this gaming marvel was simpler than beating level one of a classic arcade game. Unbox, plug in, power up, and voila! I was transported into a world of immersive gaming splendor.\n\nLet's talk power, folks! With a whopping 1TB SSD, it's like having a storage vault for every gaming adventure imaginable. The 16GB RAM felt like having a brain that processes game data quicker than a cheetah chasing its prey. The console revved up like a finely tuned sports car, promising gaming speeds faster than my cat chasing a laser pointer.\n\nThe promise of true 4K gaming sent shivers down my spine. The graphics were so sharp, I could almost see the pixels having a party! And with up to 120 frames per second, it's like watching a movie in fast-forward, only it's your gameplay and not a rom-com.\n\nThe Wireless Controller is like an extension of your own hand – sleek, comfortable, and responsive. It's like having a magic wand (minus the spells, but hey, your gaming skills might feel magical).\n\nThe Velocity Architecture? It's like having a gaming time machine, reducing loading times to mere blips on the screen. I blinked, and suddenly, I was in the midst of epic battles without the agony of waiting.\n\nHowever, even this gaming behemoth has its kryptonite. The only downside? The wallet might feel a bit lighter after acquiring this gaming beast. But fear not, for the hours of gaming joy it provides will make you forget about those dollar signs faster than a high-speed race in Forza Horizon.\n\nNow, maneuverability? Let's be real – this console isn't going anywhere. It's like a monolith, firmly rooted in your gaming universe. But who needs maneuverability when you're anchored in a realm of gaming nirvana?\n\nIn conclusion, the Xbox Series X is a titan among gaming consoles, a symphony of power, graphics, and sheer gaming delight. It's a gaming paradise that turns button-mashing into a delightful symphony of pixels. So, grab this console, embrace your inner gaming legend, and embark on gaming adventures that'll leave you shouting \"Achievement Unlocked!\" like a boss!",
                "2": "I bought this for Christmas for my son and we love it. It’s very user friendly and the graphics are wonderful. The package it came in was fun and very professional! Downloading disc games can take a while sometimes, but the system is fantastic! I absolutely adore the backwards compatibility!!! Absolute favorite feature for sure! This was the main selling point for me when I was looking into a new console to buy. I didn’t see the point in buying a PS5 if I couldn’t play the PS3 games that I currently have from my older system. At least with the Xbox series X I can still play the 360 games that I have and even buy more 360 games if I want! The memory is outstanding as well! Xbox also has a family settings app so I can keep up with the games my son is playing and how much time he logs on his system, as well as any messages from “friends.” Definitely worth the money in my opinion. Family friendly. User friendly. Just amazing. Keep up the good work Xbox!",
                "3": "I bought this new console specifically for starfield. pretty sure my XOX was not going to run it. but I play a ton of Xbox games anyway so I didn't mind. it was well worth the cost. The NVMe SSD is phenomenally fast. I want to get another for the external expansion plug. I have a 500 GB SSD and a 5TB game drive plugged into the USB 3s. but the quick start is really awesome so I would like to have another stick for increased room there. some games need to be restarted every so often. Cyberpunk crashes if you use quick start too many times on it. it's an unstable game after running for 20 to 30 hours without a restart. That's fair. I'm not super picky about that because I get a lot of enjoyment out of the game.\nwhat I don't understand, Microsoft, is why Seagate is the only supplier of the NVMe expansion cards, and why they are all out of stock!\nand another thing, an NVMe for my PC is about $50. why are the expansions for this console $150? why don't you have one yourself, instead of only supplied by Seagate?\nbut that complaint belongs on that other product, not the XSX. although this is a good place to bring it up as well.\nthis console is noticeably faster than my XOX. you might say that's obvious but the OS / dashboard is remarkably faster. I had to run something on the XOX to transfer games over and was surprised at how sluggish it is. I had just gotten used to that and didn't know that it could be so much faster. and it is on the XSX! it is so much faster!\nI was happy to see when this popped up in stock for the first time in years, literally. I grabbed it immediately because starfield was coming out and I was going to do my best to get it to run on the XOX but was skeptical. so, grabbing this was a no-brainer. I'm happy that I got it for $500 and that I waited for supplies to resume.\nit's a surprisingly heavy black box! noticeably heavier than an Xbox One or XOS or XOX, and I owned all of them. what in the world is in that little box that makes it so heavy? it feels like there's a pound of gold inside. it must be a very heavy dense heat sink because I can't imagine silicone and plastic weighing so much. motherboards definitely don't weigh very much. The 4K Blu-ray doesn't wait that much. The power supply? yeah, probably, that might be integrated with the heat sink. not a complaint but just interesting.",
                "4": "My order arrived early, which was awesome. The device works as described, and there were no scratches or dings. My only concern was how it was boxed, they used an oversized box when packaged, but only placed one piece of paper inside, so when it was shipped the Xbox itself was moving around and getting jarred the entire time. It actually dented up the front of the packaging but fortunately everything still seems to work perfectly.",
                "5": "This here Xbox Series X console, is the best of the best!!!! High speed power, 120 FPS, gaming power to the max!!!! Such a great purchase, I will purchase again in the near future for accessories!! Thank you Amazon for your amazing support on this product. I couldn’t thank you enough for the support.",
                "6": "Xbox Series X is a huge improvement over the Xbox One I was previously using. I recommend upgrading if you are using an older Xbox model.",
                "7": "Very simple to set up and transfer from an Xbox One and felt the difference between next-gen. It's very helpful in showing what your setup can and can't do. At $399.99, the Series X is worth it.",
                "8": "I have been a gammer all my life, have owned almost every console since the Atari Pong all the way till the Ps4 and Switch, but I have skipped most Xbox' s except for the original that was given to me as a gift.\nThis new console that Microsoft has made is in my opinion the absolute best in this generation. Spec-wise it cannot be beat and if superior to the PS5 I most respects. But when you use your series X and in conjunction with Game Pass Ultimate (GPU), it simply becomes the hands down, no questions asked, absolute BEST VALUE in gaming anywhere! Today Microsoft has also teamed up their GPU service with EA, and now we can get most sports games and most EA titles included in GPU. But you must also add the future inclusion of Bethesda and all their amazing titles from day one in GUP since MS has bought them out.\nSo how can't you go wrong with the MOST POWERFUL CONSOLE EVER MADE and the potential of including GPU to make it the best value in gaming PERIOD.\n\nYes some will think that their are few titles specifically made for this new generation as of this writing, but the same goes for Playstation, and Sony changed their mind in the short term, as most titles that they have as great exclusives are also being released for the foreseeable future on PS4 as well as PS5.\n\nPROS:\n- Best Value in gaming when used with Game Pass Ultimate.\n- Most powerful console ever made (12TFLOPS - 52 CU's).\n- Intuitive and very functional OS.\n- Great games even for this generation like: Medium.\n- FPS Boos feature for older games.\n- Automatic HDR for older games.\n- Instant Resume feature is just awesome!\n- Great controls, I thought I would not like them, BUT THEY ARE GREAT!\n- Minimalistic design, that goes well with anything you have already.\n- QUIET there is no noticeable sound of fans even when gaming for hours.\n- More available space in internal drive then PS5.\n\nCONS:\n- Controllers use a AA Battery... WHY would you do this in 2021? Yes there are options, but I should not need to look for options, personally for now I went the rechargeable Energizer route, but it is a hassle that should not be present in a console this generation.\n- No gimmicks and straightforward pure power, no you don't get resistance in the adaptive triggers like a PS5, makes it feel a bit less futuristic.\n- Had a bug happen to me more then once while purchasing new games, got an error, so for workaround had to add to cart, go to billing address, put edit, select the same billing address and then it worked, very annoying.\n\nSPECS:\n- Processor: 8-core AMD Ryzen Zen 2-architecture CPU at 3.8GHz (3.6GHz with SMT)\n- Graphics: AMD Navi/RDNA 2-family GPU with 52 CU at 1.825GHz (12TFLOPS FP32)\n- Video:16GB GDDR6 with 14Gbps 320-bit interface (10GB at 560GB/s allocated to GPU, 6GB at 336GB/s allocated to rest of system with 3.5GB for GPU)\n- Die Size: 360.45 mm2\n- Process: 7nm Enhanced\n- Memory: 16 GB GDDR6 w/ 320mb bus\n- Memory Bandwidth: 10 GB @ 560 GB/s, 6GB @ 336 GB/s\n- Internal Storage: 1 TB Custom NVME SSD\n- I/O Throughput: 2.4 GB/s (Raw), 4.8 GB/s (Compressed, with custom hardware decompression block)\n- Expandable Storage: 1 TB Expansion Card - Seagate ATM only avail.\n- External Storage: USB 3.2 External HDD - WB Black Gaming 5TB what I got for it.\n- Optical Drive: 4K UHD Blu-Ray Drive-\n- Performance: 4K @ 60 FPS, up to 4K @ 120 FPS, 8K @ 60 FPS\n- Size: 301mm x 151mm x 151mm\n\nFinally, I will recommend this console over the the PS5, its simply a BEAST and a better value when teamed with GPU. I won't get a Ps5 for the foreseeable future at least not till late 2022, since by then they might really have PS5 exclusives that don't get. a PS4 version.\nThe Xbox Series X is such a great console that you would be hard pressed to look it over over the hype that the Ps5 has generated because of its lack of availability. So if you like simply the best console this generation and wish to get the best bang for your buck, Xbox Series X simply rocks.\n\nPRO+ : The Xbox series X is also an amazing emulation system, it can run Retroarch with no hacks, with nothing weird, just look it up in YouTube and you will find tutorials. But it can do emulation like very few systems and it add to its tremendous lineup and value.\n\nGreat job Microsoft, you not only added a customer, but a new fan.",
                "9": "Our old Xbox One was dying a few months back, so we bit the bullet and upgraded to this. We both play, so we also got an extra controller (the console comes with one). I took the extra one, and my husband took the one that came with the console. In case you're curious, my old controller's buttons were starting to give out as well right around the time the console was dying, and my husband wanted a backup controller, hence the need for two new controllers instead of just one. Anyway...I was using the \"extra\" one because it's purple (yay!). It works fabulously. The console itself is amazing because all the games we have played load ridiculously fast, and the graphics are amazing. Then the not great part: my husband's old controller (which we *just* bought last Christmas) died one week after getting the new console up and running. No biggie, we have the new controller to use, right? So he grabbed the one that came with the console and started using it. That was just a few months ago. The stick drift started a few weeks ago, and it got really bad really fast. That controller is straight up unusable now. Thank god for the black friday sales coming up this month. Given how new the console and controller are, I thought someone would help us, but no. Neither Amazon nor Microsoft/Xbox care one bit. I guess less than 6 months is now the expected lifespan of a new controller? At least the console is nice.",
                "10": "So, yeah, new generation of hardware from Microsoft but can I talk about that box? Because that was a spectacular way to jump into the next Xbox.\n\nYou open the box up and there is the Series X all wrapped up like it's in a treasure chest. It was great! I actually had to take some video of it because it was above and beyond what I expected from unboxing a new console. So good job on that!\n\nI'm upgrading from an Xbox One S and from that perspective, it was definitely time to upgrade. I've got this 4K TV without a system that properly utilizes it! I held off on getting a One X because I knew the next Xbox system would be coming out soon enough.\n\nAnd here it is.\n\nVisually speaking, I'm not really noticing TOO much difference from games on the One S. There are some added details on some of my old games to upgrade them to 4K and I notice some effects that weren't there before. Everything is less fuzzy. So that's good. It's just not the same as the visual jump from the NES to the SNES. Or the Playstation to the Playstation 2. But it IS close to the leap from the Xbox 360 to the Xbox One. The difference there was only noticeable a few years after the fact for me. I imagine the same will be true here, especially since most of the games I'm playing right not are Xbox One games upgraded to 4K and not native Series X games, beyond Yakuza: Like a Dragon.\n\nAnd that details the biggest drawback to getting a Series X at launch: lack of a strong exclusive library of games. While the Playstation 5 has Spider-Man: Miles Morales, Godfall, and Sackboy, there isn't anything on the Xbox that can't be played on the PS5 except Yakuza: Like a Dragon (and that can probably be played as a PlayStation 4 game through backwards compatibility). With Halo Infinite being delayed, there's no massive reason to upgrade your hardware.\n\nWell... I SAY that but I also don't regret doing so. I'm disappointed in the lack of exclusives but the 4K is still very nice. And it isn't even the best part of the Series X. That would be the load times. With the new hardware and the new memory storage system, games load incredibly fast. I used to start a game up and then head into the kitchen to grab a drink or whatever while the console booted things up but those days are done. This thing zips along. That also applies while you're in the game. Reloads and fast travels, even cut-scenes, happen swiftly. There's a lot of power in this rectangular box. The Playstation 5 also has super fast load times so it's not a selling feature if you're comparing consoles but, on its own, it presents a compelling case.\n\nIt's a lot of the \"under-the-hood\" features that build this system up as a good replacement for your Xbox One. The fact that it is capable of playing a large number of Xbox's back catalog going all the way back to the original Xbox means you'll have a huge library of games to play even if they aren't brand new exclusives. I've got a serious backlog of titles so playing them in 4K and getting into my games faster is fine for me right now. If you are a Gamepass subscriber, you have a large library of games to choose from right out of the gate, including a lot of EA games added from their EA Play subscription service. I spent my first day just downloading everything I'm going to be wasting my time on over the next few months.\n\nAnd, let me be clear: if you play on Xbox, do yourself a favor and subscribe to Gamepass. You get some great games and many of them are upgraded to take advantage of the Series X. It's a good deal.\n\nI'm happy with my purchase. I wish Halo would have made launch. I'm also happy they held it back so that when it releases, it's worth playing. But, man, launch would have made this purchase a lot more palatable. In the end, it comes down to where your friends are. Mine are on Xbox so here I am. This thing is a powerhouse and I doubt I'm going to regret having it a year or so down the line.\n\nBut if you have to make a choice between this and the Playstation 5 and you don't really do online gaming with your friends, the Playstation 5 makes a more compelling case this holiday season. Miles Morales looks really good.\n\nBut if Sony's exclusives don't move you, the third party games are all multiplatform. You can enjoy your Call of Dutys and your Assassin's Creeds on whatever console you manage to get. In 2020, I think we could all use a win and I think there's enough to keep you busy on both consoles to check that win box.\n\nOh! This thing also has a controller! It is pretty much exactly like the Xbox One controller which was a slight upgrade from the 360 controller... which was an upgrade from the Xbox S controller. This is my favorite controller layout and it feels as comfortable in my hands as the XB1 version. There's a capture button now to take pictures and video which is something Sony added with the PlayStation 4 and Nintendo added on the Switch. So Microsoft is a little behind but it's here now! I have not used it yet but I'm sure I'll get around to it.\n\nAnyway, welcome to the next generation of video game hardware. This thing is a beast of tech and should prove a worthwhile purchase. In time. Day one, you know what you're getting: an I.O.U. note promising better things to come.\n\nBut, man, that treasure box opening is pretty great. ;)"
            }
        }
    },
    {
        "Product Index": 4,
        "Product Data": {
            "Product Name": "Meta Quest 3 128GB— Breakthrough Mixed Reality — Powerful Performance — Asgard’s Wrath 2 Bundle",
            "Product Price": "499",
            "Product Rating": "4.4",
            "Product Number of Rates": "1,959 ratings",
            "Product Image Address": "https://m.media-amazon.com/images/I/81whTB488bL._SX342_.jpg",
            "Product Description": " Get the epic new Asgard’s Wrath 2 included (a $59.99 value)* when you buy Meta Quest 3 128GB*. Dive into extraordinary experiences with a mixed reality headset that transforms your home into an exciting new playground, where virtual elements blend into your actual surroundings. It’s the most powerful Quest yet*, featuring next-level performance with more than double the graphic processing power of Quest 2. (*Based on the graphic performance of the Snapdragon XR2 Gen 2 vs Meta Quest 2.) Experience more immersion with dazzling visuals with the 4K+ Infinite Display (a nearly 30% leap in resolution from Quest 2) and rich 3D audio with enhanced sound clarity, bass performance and a 40% louder volume range than Quest 3 Reach out and touch virtual worlds with Touch Plus controllers that give you fine-tuned precision, realistic sensations and more intuitive interactions. You can even navigate without controllers with Direct Touch that follows your gestures, so you can use just your hands to find your way. Explore the world’s best library of 500+ immersive apps and find your favorite content across gaming, fitness, wellness, entertainment, social experiences and more. Get up to 2.2 hours of usage on average with the option to extend your battery life further with Battery Saver mode. Use the included 18W power adapter to fully charge your headset. ",
            "Product Reviews": {
                "1": "Update: Five Weeks Later\n\nThe Quest 2 was so unbearably painful and uncomfortable for me, no matter what I did, that I ended up returning it a day later.\n\nI was actually afraid that the Quest 3 wasn't worth getting because it weighs the same as the Quest 2, even 12 grams more.\n\nBut the Quest 3, with its default strap, is wonderful to wear. It doesn't feel heavy at all. I like how the facial interface, headset weight, and straps feel. I can wear the Quest 3 for many hours, maybe even the entire day. If I do feel some discomfort, I can easily and quickly adjust the headset so that the pressure points are relocated to somewhere else.\n\nI originally didn't care about passthrough and foolishly wished that they had made a lighter headset without the upgraded passthrough, but now passthrough is everything to me. It let's me be entertained and productive while also being fully aware of my surroundings. Some games and apps that I have used with passthrough are Immersed, Virtual Desktop, Eleven Table Tennis, and Meta Quest Browser for AR female hologram eye candy. One of the first AR games that I tried is a free game called First Encounters. It's a game where the walls of your house become cracked, exposing another world in another dimension, and these furry spaceball creatures jump through that world into your house and you have to capture as many as you can within a time limit.\n\nAnother thing that I like about the Quest 3 is that there is a smart guardian. On the Quest 2, if you step outside a small circle, you get kicked out of the app that you were using and get told to create a new boundary. On the Quest 3, I have my entire house as my boundary. Well, to be specific, I only drew the boundary in the rooms that I needed. So for me, the boundary including my living room, kitchen, bathroom, and hallways in between. It's so great to be able to walk around the entire apartment and be able to continue using my VR and AR apps with no interruptions.\n\nI bought the 128 GB version, and it seems to be good enough for me. If there had been a 256 GB version, I might have bought that, but I didn't think I would need a 512 GB version and I think that is definitely still true for me. Even as time goes by and more and more interesting apps become available, I don't think that I will regret my decision and wish that I had more memory. It's super fast and easy to uninstall and reinstall apps, so that's a way to manage memory if I start running out of room. Out of the 128 GB, 18 GB is being used for System apps, but one month later I have installed around 30 apps and games and I still have 51 GB available. Of those 30 apps and games that I installed, there are less than 10 that I am sure that I will keep installed and the other 20 will eventually be uninstalled and replaced by different apps.\n\nI can use some apps while lying down, like Immersed, Virtual Desktop, Meta Quest Browser, and DeoVR. I love how I can see and use apps when I am doing exercises or I have my face buried in a yoga mat. The Quest 3 may end up being a life changer and game changer for me. It might help me be way more productive and it might make me a happier person in general.\n\nThe Quest 3 is something that every single person on this planet should get if they can afford it. It cost me $499 plus tax and came to $533. I didn't think that I would need any additional accessories, and one month later that is still true for me. I don't need a different headstrap or extra battery packs. I just use an extension cord in which I plug in the default Quest 3 wall charger and link cable. The extension cord that I use is a 15-feet one that I bought seven years ago for $15 (https://www.amazon.com/gp/product/B0000BYC1I) and it lets me go into every room in the house without unplugging the cord or the Quest 3 cable. I wear a velcro back brace during the day because of my bad back, and I just tuck the extension cord into the front part of my back brace. I saw advertisements for VR Covers to keep the interface clean, but even though I have been using the headset every day I don't feel like my interface has become gross or unhygienic. It still looks and feels new.\n\nBattery life while plugged in is good. On some apps and games, the battery level stays around the same. On other games and apps, there is a drain while the Quest 3 is plugged in but I usually play a long time and then take a break when the battery gets down to 80%. I can only imagine how many hours of gameplay I would get if I let the battery drain all the way to 5%. Too many hours. I would never play that long. I definitely do not suggest using the Quest 3 unplugged. Two hours goes by too fast, and that is two hours maximum. If you are using AR and passthrough stuff, or some demanding apps and games, it could be a lot less than that like 0.5 to 1.5 hours.\n\nI just can't get over how great the Quest 3 is. I hated the Quest 2. I don't know what other VR headsets are like, but the fact that most of them at least 200 grams heavier doesn't appeal to me. But the Quest 3 is delightful.\n\nSome apps and games that I really like are as follows...\n\nVirtual Desktop. I prefer it over the Oculus Link. If you decide to use Virtual Desktop, you only need to buy the Quest version (don't buy the Steam version), and then go to the computer browser Virtual Desktop website and download the free Streamer App for your PC. The free Virtual Desktop Streamer App lets you stream your PCVR games to your Quest headset, wirelessly. By the way, wireless does not have any lag or loss of performance, so don't think that you need a cable to connect your Quest 3 to your computer for PCVR gaming. It's better to use a wireless connection. It has been advised to have a good WIFI router and to use an Ethernet Cable to connect your WIFI router to your PC. I did use an Ethernet Cable, but my router is a four year old ARRIS SURFboard SBG6900AC Docsis 3.0 16x4 Cable Modem/ Wi-Fi AC1900 Router that I bought for $106 and it works well, so maybe you don't need the best WIFI routers. Virtual Desktop lets you have a virtual desktop in passthrough mode, but Immersed lets you too and in Immersed you can have up to four computer screens and you get to be around other users and their avatars. I still use Virtual Desktop for the head lock feature, which keeps the desktop screen in front of your face no matter what direction are are facing or where you move or walk to. I use it to read manhua while walking around the house for exercise. I am hoping that the headlock feature will be added to Immersed soon.\n\nResident Evil 4. I never cared for any of the RE computer games, but maybe it's because it is VR or something but it truly is fun walking around in a realistic setting. I like the scenery better than Arizona Sunshine or The Walking Dead. The first Red Matter game was great, but sadly it was short and doesn't really have any replay value once you've completed the story. Green Hell looks really interesting. It's a realistic survival game. Survival Nation is a zombie apocalypse RPG game that is sorta interesting if co-op RPG games are your thing. It is a satisfying feeling stabbing zombies in the head with a knife in The Walking Dead: Saints and Sinners. Arizona Sunshine is a decent zombie game. Genotype is a bit interesting. but the texture detail isn't as high as I would like.\n\nFor fitness, I like Eleven Table Tennis and FitXR.\n\nI also suggest getting custom app launchers like Lighting Launcher, but also Quest Games Optimizer ($10) which lets you increase the resolution of native apps and games (not PCVR). On QGO, if you increase the resolution of Horizons Home, the environment and mirror you see when you first turn your Quest 3 headset on, there is a remarkable difference.\n\nAs far as PCVR goes, I haven't really played much PCVR content. I wanted to play and enjoy Contagion VR: The Outbreak, but I get too much motion sickness from it because the left joystick moves my character way too fast. There is a plugin for SteamVR called OVR Advanced Settings, but the only thing that I like about it is that you can do an emergency y-offset if your character glitches and falls through the floor in PCVR games. It has other features like key binding, but I don't care about changing my controller keybinds. OVR lets you change the snap rotation angle, but I don't like how it is done because you have to use buttons for snap rotation and not the joystick. So instead of tilting the joystick left to rotate left a custom number of degrees and tilting the joystick right to rotate right a custom number of degrees, you'd have to use buttons like A for rotate left and B for rotate right. Really stupid. And not only that but the dev told me he can't let us adjust movement speed, but the reason he gave me was so idiotic and seemed so insincere and untruthful. He said \"it will vary game to game..... additionally different acceleration profiles will have drastically different effects on your comfort\". It sounds beyond stupid because I was already at extreme discomfort, so being able to adjust the movement speed temporarily would have been a good thing and not at all bad. And I can always change the speed back when I am done. It's not hard to change the speed from 100% to 10% and then back to 100% again.\n\nAs far as PCVR gaming goes, I am using the Quest 3 with a Laptop - GTX 1650, i5-9300H, and I haven't had any problems.\n\nOne thing about Oculus Link (Wireless) and Oculus Link (Wired) is that they might not work right unless you go to Go to Oculus Desktop App > Settings > Beta > and enable Public Test Channel and let the app update. I don't use Oculus Link, but that is important to know so please make note of it. Some apps and games only work with Oculus Link, like 3DXChat seems to only work with Oculus Link and won't work with Virtual Desktop.\n\nI think that it is kinda weird that the Quest 2 has 85% five star ratings on Amazon, and this Quest 3 which is a billion times better has only 65% five star ratings. If you can't appreciate better technology and advancements, then go have yourself frozen for 50 years and stop discouraging other people to try the Quest 3. Possibly the more people that buy the Quest 3 and use it, the more Meta will devote themselves to VR technology in the future. This could ensure better VR headsets in the future and maybe guarantee more Quest headsets (Quest 4, Quest 5, Quest 6, and so on). I just don't get how everyone had Pintos two years ago, this BMW comes out, and instead of being happy at how much better the BMW is than the Pinto you complain that it isn't a Porsche. Entitled much?",
                "2": "So, I started with the original Oculus Developer Kit 1, then on to 2, then the consumer Rift, Rift S, Quest 2, and temporarily had a Quest Pro (a great piece of tech, but too expensive..returned in 1 week). We've come a long way with Quest 3....\n\n- The clarity of the new \"pancake\" lenses are a marvel after dealing for years with the now primitive, Fresnel lenses. No more having to reposition the flipping headset around, over and over just to find that one tiny spot of clarity while their outer area remains blurry. These flat pancake lenses are just super clear all around, from edge to edge.\n\n- The resolution bump from the Q2 is another nice welcome. The blacks are not jet black like you would find on an OLED screen (like the PlayStation VR2), but that would bring the cost up. When you're playing games or experiences, you won't even be thinking about it. Would you rather have fresnel lenses like PS2VR? I don't think so. In addition to these new features, the fieild of view has widened on Quest 3, another upgrade that makes a difference.\n- The sound is beefier and louder. No more tin can alley like the Q2, and the fantastic spatial sound adds more to the immersion. I went back and played some older games, finding sounds that I've never quite heard on Quest 2, which really surprised me. The haptics are also very much improved over the Q2, though not as potent as I would have liked. The Pro controllers are more advanced in this department, as is the PSVR2.\n\n- The controller wrap around rings over the hands are a thing of the past, and good riddance. These controllers feel great, and track without a hitch. I'm super glad that they are sticking to regular AAA batteries for the controllers. They last a sick amount of time, as opposed to the Quest Pro controllers which are rechargeable. Some people prefer that style, but I prefer having to simply replace batteries and continue playing, rather than waiting for yet another device to recharge Plus, I remember getting overheating warnings with the Pro Controllers, and they never felt warm. If you didn't put the controllers down for a bit, the warning would not go away. There's a number of complaints about this odd issue in the Oculus forums. Not sure if they fixed this by now, but I do remember the Oculus mods being dumbfounded by this ordeal.\n\nThe Mixed Reality / Passthrough\nAs someone who's been around the tech industry for over 35 years, this is a new level of entertainment. Mixed Reality puts virtual objects right in your real space. Imagine sitting on your couch, viewing your entire room, while watching a spaceship break through your ceiling and land on your couch. Following that, you'll view in amazement as alien fuzzballs start breaking apart the walls to your surroundings, trying to get in, while revealing a complete alien landscape as you race to catch those critters with the supplied blaster as they pop in and land on your floor, and furniture! You have to see it to believe it. You're still in your room, but now all the walls have been blown out. This all works convincingly thanks to the new room scanning feature, which is something right out of the Matrix. You simply walk and look around your room(s) as it automatically detects walls and obstacles during setup.\nHow about playing a dungeon crawling board game ON YOUR ACTUAL TABLE, or break into a sweat as zombies smash through your doorways, and climb in from the windows. If that's too much, then why not set up a giant TV screen that would dwarf the real TV in your room. Dozens of games and apps already have been updated to support mixed reality, so there's already many things to try out. Every day seems to bring more.\n\nThe beauty of Mixed Reality is that you're not fully engulfed in Virtual Reality. You're still seeing all of your real world, but the virtual stuff comes to you! This is a wonderful way to introduce newcomers to VR who may not feel comfortable completely cut off from their surroundings. So, now you can exercise with a virtual trainer, box against a computer opponent in your own living room, or explore your house which can be haunted with ghosts. All this can be done without worrying about kicking your dog, watching if your baby wanders away or smashing your skull into a real TV set. One other advantage, it cuts down the possibility of motion sickness which can be a problem for certain people. The one big complaint about mixed reality - the passthrough is kind of fuzzy, so your real world has kind of a grainy film over it, and when combined with the stunning virtual objects, there's a stark difference. Good lighting helps the situation, but ultimately, it becomes a non-issue because once your play area is combined with the virtual world, you won't even be much concerned about the quality; your room becomes the backdrop as your eyes are mainly focused on the virtual parts, leaving the whole mix to be quite convincing, and for this price point, to have this feature? Are you kidding me? It's amazing!\n\nOf course, you can alway play in total virtual reality, because that's still the popular choice for hardcore VR enthusiasts. Speaking of which, I've seen many comments on various forums where VR veterans were knocking mixed reality, saying things like \"who wants this? I don't need mixed reality, I will only play in complete Virtual\". After a few days, I already saw a change of heart. Now it's, \"oh wow, I never thought I'd get into this, now I want more!\". Yeah, mixed reality is here to stay and grow.\n\nThe comfort\nWell, here's where I personally find a negative. The default strap provided with the Meta Quest 3 is similar to the strap on the Quest 2, however, this has a bit more stability, with its adjustable Y-shaped back. It's one of those things, you try on, and think - oh, this isn't bad at all, only to find shortly after, either your forehead, cheeks or both feel a bit too much pressure. It's not as bad as the Quest 2, as the Quest 3, doesn't protrude as much, due to its new design, but it's no way good for long play sessions. I simply purchased a 3rd Party Elite-style strap on Amazon.. so mission accomplished there as it's a very comfortable, halo-style ($37.00) which is the way to go.\n\nBattery life\n...is still short - around two hours, though some complained it's even shorter. I tend to use an ultra-long C cable plugged into an Anker power supply and I can go all day, and only take it off if I'm playing something like Beat Saber, or anything else that requires a lot of crazy hand movements.\n\nPCVR\nLike its predecessor, the Q3 will work with your PC Oculus and Steam VR games, providing you have a powerful PC. With the new resolution, wider FOV and lenses, PCVR games look better than ever!\n\nOverall - I absolutely love the Quest 3, even my spouse who had no interest in VR was amazed by the mixed reality and now wants one as well.",
                "3": "There is no doubt this thing is superior to the Quest 2 in almost every way possible. Is it worth the increase in price to $499? Probably. The Quest 2 was sold at low margins to gain market share and if you compare this to the PSVR2 headset you could make a solid argument that it offers a lot more value.\n\nPros -\nDisplay - this is the biggest improvement from the previous generation. I would have never contemplated using my Quest as a desktop replacement prior to using the Quest 3. I probably still wont, however, the fact that I even considered it is testament to the clarity this thing provides.\n\nAudio - another step up from the previous generation and probably the only other major improvement\n\nAR - so much potential. Still early stages so who knows how well this will be utilized.\n\nCons\n\nDisplay\n\nWhile the display offers marked improvement there are a couple of things you should be aware of to keep your expectations in check.\n\n1. Pancake lenses have a slightly annoying reflection effect in high contrast situations. If you're a perfectionist, it will piss you off. It's almost like the lenses look smudged in certain conditions but in fact it's just a reflection effect.\n\n2. The screen door effect is almost gone but it is still slightly there. Much better but not quite gone.\n\n3. I had hoped they would use OLED on Mini LED panels in this thing but unfortunately they didn't. Watching movies would be amazing with a panel that didn't have this much LCD glow, especially with the improved sharpness. Oh well, something for the Quest 4 to improve upon.\n\n4. The FOV has barely improved. This thing would be insane if it didn't feel like you were looking through a large pair of binoculars. I'm not sure what it would take to improve the current FOV but it definitely prevents complete immersion.\n\nComfort\n\nThe headset is a little challenging to get seated on your face properly without generating uncomfortable pressure. There is also this new gap at the bottom of the nose region that I'm sure exists for a reason but it hurts immersion as you can see the floor.\n\nEcosystem\n\nThere isn't a lot to take advantage of the new processing power and AR features of the headset\n\nPassthrough\n\nThere is no doubt that it is significantly better than the B&W grainy mess in the previous generation but it requires good lighting conditions to approach anything that you've seen in demo videos. The other thing to be aware of is that the headset records video in higher fidelity than it is able to pass back to the headset display in real time. I'm not sure why this is the case but I'm guessing there is some post processing going on to clean up the videos that the headset can't do in real time.",
                "4": "Disclosure: I paid for this item with my own money\n\nSixteen months ago, I bought a Q2 [for PCVR¹, thus far the native apps aren’t of interest] and didn’t use it as much as I’d expected.² With this in mind, frankly, I had some serious reservations about getting a Q3, but now that I have one in hand and can compare them side-by-side, I’ve ZERO regrets.\n\n😺 Resolution: improved, but not enough to be the sole reason to upgrade.\nI can still, just barely, see the space between pixels. The rendering of small text elements is more readable as they are better formed and there is less shimmer.\n\n😻 Lenses: WOW!\nThe difference in clarity between the Q2’s Fresnel lenses and the Q3’s pancake optics is night and day. Not only is the clarity improved, but the “sweet-spot” is huge in comparison. Definitely a reason to upgrade.\n\n😺 Field of View: noticeably improved both horizontally and vertically.\nWhile still constrained, it feels less like I’m viewing the world through a scuba mask.\n\n😿 Contrast: comparable\nBlack is still dark grey. I really wish they had used micro-LED (as they did on the QPro) or OLED displays.\n\n😻 Pass through cameras: a significant QoL improvement\nAs a glasses wearer (I bought a set of third party prescription lens inserts), it's really nice not to have to take off the headset to do a lot of things which, on the Q2 required removing the headset, putting on my glasses, doing the thing, taking off my glasses, putting the headset back on, and adjusting it for comfort. I should acknowledge that a privacy/security minded individual might well find the improved pass through cameras disturbing. You may find yourself, as I did, doing things like unlocking your phone or entering your computer's password with the headset on. 😬😬😬😬\n\n😻 IPD settings: significantly improved\nThe Q3 offers fine grained control, while the Q2 coarse-grained control gives you a choice of just 3 settings.\n\n😐 Controllers: neutral\nI liked the rings on the Q2’s because they served as built-in stands; there are no rings on the Q3’s. Otherwise, they feel good in the hand and work just fine.\n\nThings I’ve not specifically tested, but are noted in the reviews I’ve read while doing my pre-purchase research:\n• battery life: reportedly worse than on the Q2\n• sound quality: reportedly worse than on the Q2\n• eye-relief mechanism: the Q3 has a built-in mechanism to adjust the lens distance, while the Q2 required the installation of spacers\n• native gaming experience: the Q3 reportedly has 2.6X GPU power and 2.1X CPU power as the Q2\n\nOverall: while I’m sad there weren’t any BF/CM deals for the base model Q3, at $500+tax, it’s a still terrific bargain. It’s a shame about the contrast though 😹\n\nBTW: setup requires pairing with the Oculus app on your phone. Neither the app nor the screen in the headset tells you that the phone must be connected to the same wifi network as the Q3 AND bluetooth must be enabled. I didn’t have wifi enabled and couldn’t figure out why it wouldn’t pair until a trip to the interwebs revealed the fix.\n_____\n¹ — For PCVR I’m using Virtual Desktop. Some folks swear by Meta’s own Quest Link (some preferring the WiFi version, others, the wired version using USB), but it seems they are predominately owners of Green Team graphics cards. I’ve got a Red Team 6800XT and Virtual Desktop gives me the best results by far. To minimize latency, the headset is connected directly to the PC, which is hosting a dedicated hotspot. I’ve not tried yet Quest Link with the Q3, but Virtual Desktop handles it just fine. [A curious aside: on my system, Virtual Desktop’s “HVEC 10-bit” encoder, which graphically is better than the plain “HVEC” encoder, also has a lower latency!]\n\n² — Considering the price I paid vis-à-vis. what it can do, I still regard the Q2 as a true bargain. In a sense, even its limitations were a positive, because it made me aware of what I wanted out of my next headset.",
                "5": "I've been in the VR game for a while now, going all the way back to the Oculus Rift dev kit 2 days. My other current headset is a Valve Index, and I mainly bought the Quest 3 with the intention of playing the Quest-exclusive games, fully expecting it to feel like a toy in comparison.\n\nIn practice, I'm in love with this thing. The displays are both high resolution and high quality, with little to no screendoor effect, and the tracking is impressively stable for something only being tracked by cameras and software. I thought the removal of the rings from the Q2 controllers would cause them to have more issues with occlusion, but I haven't noticed anything. Even the features I didn't know it had are pretty cool for the games that support them, like its mixed reality and controller-free hand tracking. But the thing that's really going to keep me away from my Index (at least for the games that aren't specifically tailored to it, like Half Life Alyx) is that I had no idea how much I needed to ditch the cable and play wirelessly until now. Being able to just walk around in my room without having to be aware of the cable behind me is such a nice feeling that it feels like I'm getting into VR for the first time again.\n\nWith that said, there are some small caveats -- namely, that this is not really a $500 headset. Meta has taken on a sort of Spirit Airlines approach, where the headset itself is affordably priced in exchange for other basic things being extremely expensive \"accessories\". The strap is the main offender, with the default one being the rough equivalent of just tying the headset to your head. They're happy to sell you a $60 strap, or a $130 one that extends the battery, though! And while you're at it you can blow $80 on a cable for linking it to your pc if you aren't a fan of wireless tethering, a $70 carrying case, a $40 silicone facial interface for extra comfort, a $130 charging dock to replace the controllers needing AA batteries, $40 hand straps for the controllers to give them Index-esque free-hand support... To be clear, most, if not all of these have off-brand counterparts that are just as good (or better!) for a fraction of the price, but my point is this is not a fully out of the box experience for those with more discerning tastes. For parents buying them for their younger children they'll probably be thrilled with it anyways, and can safely ignore all of that, but I would wager most adults will probably end up wanting at least a new head strap of some kind, whether it's the official one or not.\n\nIgnoring the troublesome accessories, though, this is an easy win as far as I'm concerned. The only real competition is that the Quest 2 is still holding its own as well from what I hear, and for prices that seem to be as low as they could possibly be around the holiday season. I can't speak first-hand on whether the Q3 is worth a $300 difference, but I can say I don't regret buying it. I held off on the Quest line of headsets because I've never been a big fan of Meta as a company, but I have to begrudgingly admit that this is probably the best vr headset at the best price you could get right now.",
                "6": "I have always dreamed of ditching my monitors and having just a VR desktop. I could work much more relaxed than hunched over a monitor, with my shoulder muscles cramping after a day of work. I already use my laptop to work anywhere in the house, but that freedom limits me to a single screen. Note that I am a software developer by profession, and I typically spend 10 hours a day coding.\nI was actually very skeptical that I could do real work in text editors with this thing. I decided to give it a try anyway. I am very glad I did, and here's my take after 2 full days of use.\nFirst, my setup: I use the Immersed app over wifi with my Windows 11 laptop. I work tethered with a 10 foot usb cord for power only, with a 30 watt aftermarket charger, which can charge the headset while still keeping it powered up indefinitely. I started with the 3 monitors free Immersed gives you, but cut down to 2 to feel less cramped by displays. My coding is done in Eclipse and VScode, and the text is very legible. I was worried about the field of view, but it is absolutely not an issue. The pass through portal in Immersed is great to allow you to see your real desktop, with your keyboard and coffee, while the rest of your environment is some chalet in the alps, or a space station, or whatever. You can also work within your real environment, but with virtual screens floating in front of you, if you want (see my comments about passthrough further on).\nThe first day was fine except after the first 8 hours my face started hurting because of the pressure needed to keep the headset in place. I powered through the discomfort and after the 10th hour it wasn't bad anymore. Today I added a counter balance velcroed to the back strap and it has been MUCH better. I can loosen the strap so it doesn't press the headset against my face, but it stays perfectly in place due to the added rear counterbalance. I do not feel the that extra weight, only the benefit of the lighter fit on my face.\nHow about my eyes ? You may not believe it, but after I spent many hours with the headset, my eyes are actually relaxed much more than when using a monitor. I've been far sighted (had Lasik many years ago) and use reading glasses for normal work, but do not need glasses with this headset. Make sure you tweak the interpupilary distance adjustment as well as you can for yourself to avoid eye strain. I believe that I may have a slight difference in strength between my eyes that strains them with regular monitor use, but with the Quest 3 and that adjustment, my eyes feel very fresh even after 10 hours of use.. Incredible, I know. Perhaps if you have perfect normal vision, you may have issues with using the headset, but for me it's improving my experience. On top of allowing me to stay relaxed in my easy chair when I work. It's only my second full day, and if my experience with comfort changes, I'll update this review.\nSome things to watch for. I've had to reset it maybe 3 times these past two days, with a combined 22 hours of use. One time because I started getting some strange glitchiness, like streaks of gray fuzzy lines crossing my field of view all over the place, or voice command errors popping up continuously when I didn't even use it and had turned voice control off. The restarts cleared things up. One annoying thing is that though the computer speakers can play through the headset, you cannot use the headset microphone through the computer, for example in meetings or chats, so I have to keep the laptop very nearby so its microphone can pick me up. I'm sure that will be solved in a future update.\nThe passthrough cameras work, you can see the outside world enough to do what you need to do, but not very clear by any means, especially if you're not in a well lit area. This is super minor issue for me, since the virtual monitors is all I really care about, and they are quite crisp.\nMy big fear is that the headset was not meant for such intensive daily use and that it may die out on me. I guess we'll see if the Meta warranty is any good if that ever happens. I'm debating purchasing the supplemental 2 year warranty that is available to get within 60 days of purchasing the headset.\nOne last note, if you want to try a very cool experience to get a taste of VR, I highly recommend the free Oculus First Contact app in the store. A fun but very well done (imho) demo of what you can do in VR - great for all ages.",
                "7": "The product arrived today, i recorded the opening and bootup.\nNo dead pixels, passthrough works, there was a small issue with the nose piece not set but after looking it up it seems to be a common issue because of the way the VR opens/closes to adjust to face sizes.\n\nIf this occurs, gently push along the nose ridge and it will readjust itself as long as no lock-tab parts are actually damaged. I lucked out, as none of the tabs were broken and were able to go back into place.\n\nThe amazon box it came in again didn't have any protection what so ever. But the product itself was fine/stable in it's package box with appropriate padding.\n\nI had no issues getting it registered to meta, and grabbed a couple of free games that downloaded quickly enough. I haven't tried them, but I did explore the passthrough and nonpassthrough feature.\n\nVisual wise it's actually quite a bit more clear/crisp compared to the ps4 Vr(which is what I can compare it to). As it has a higher resolution/pixel count. I still haven't taken off the default stickers that protect the lenses until I can put on lense protectors. But even through all of the writing on the label that tells you NOT to use any form of liquid cleaners, even lense. It's visual is damn good.\n\nThe passthrough visual via camera is on par with a ps4 VR headset: and suffer's some glitches when it hits reflective surfaces but that is normal as camera's hate that extra reflection of light.. But interface/scenes are definitely more clear and crisp. Sound quality is good, not like being at a rock concert, but goes loud enough to enjoy. Headsets for sound actually aren't really needed for this VR.\n\nI haven't hooked it up to a computer yet, as it's suppose to be the 'big' gift for me and my fiancé to enjoy over Christmas. As it was a purchase done by the both of us - after calculating expenses..\n\nSo the big question: Is it worth the money?\n\nMy answer: Yes, I recommend going for the larger size because most of the games you will be downloading are often between 5-40gb.. With a few exceptions that could easily hit 80gb - example skyrim(haven't checked the store to see if that one is available on meta). Plus any mods one might want to add to the games.\n\nI was glad to see they had some of my more unique playstation favorites in their store. This made me happy, despite needing to buy it again. (Btw The Wizards* is excellent and lets you feel like your literally casting spells, or using a bow.)\n\nWith that said, go for the BIGGER hard drive: it will make it so your VR can hold more then 3 games without suffering quality issues. As you always want to leave room(1-5gb) for the OS(opperating system) to run smoothly. Then you won't have to worry about uninstalling/reinstalling, clearing cache/HD maintence every time you want to change your lineup.\n\n**For people with limited understanding of storage space 512GB should easily allow you to store 15-25games which if you have 'data' usage limits for whatever reason would avoid burn up of data by constantly downloading the same thing.",
                "8": "I apologize now, for this review being so long, & all over the place, but I always give honest & THOROUGH reviews that you can 100% trust... I'm never paid to review anything).\n\nPreface: So I've had my Quest 2 for 3 years now, & absolutely LOVE it. VR has changed my life for the better in so many ways. The app Horizon Worlds has brought so many great friends into my REAL life, and has given me AND my 27yr old, disabled daughter so many things to play, explore, & experience! I'm 55 lol and I'm an Beat Saber (VR) addict. I love music with a good Beat which is what drew me to beat saber & I can't believe how far I've come playing it! I've played it every single day since the day I bought the Quest 2, 3yrs ago. So I can honestly say that I DO know what I'm talking about here.\nThe Q3 does NOT track as well as the Q2 while playing at Expert and E+ levels. I noticed it immediately. If you don't play Beat Saber at at least expert level, you probably wont even have tracking issues.\nI was told by so many ppl the Q3 was soooo great. Which, it IS great when comparing to my now 3yr old Q2, that I've played 4-8+ hrs DAILY for 3 yrs. I've gone thru 3 sets of controllers, put a few little scratches in the lenses, & it starts to heat up after an hour or so...& when you already have hot flashes, it feels like wearing an oven on your face. I guess it's because it's a more powerful headset. I still don't see that much of a difference visually... certainly not enough to justify paying double what the Q2 costs!\nI also love a social app called VRCHAT. The movie theaters are unparalleled, and the visuals in there are jaw dropping...especially if you connect the headset to a good computer...(which i dont have) But vrchat now requires much more RAM than the little 6gb the Q2 provides. VRChat requires at least 10-12 gb of RAM to see all of the benefits .. I was hoping the Q3 would have at least 10-12gb of RAM, but it only has 8gb! ggrrrrrrrrrrrrr\nSince my Q3 is NEW, of course it's doesn't heat up .. yet.. we'll see! The battery only lasts 2 HOURS, so you have to stay plugged in if you want to play for longer periods. (*tip if you arent rich lol* Instead of spending extra money on fancy headgear with built in external batteries that only last another 2 hrs) I use my 20000 mah power bank and attach it to the straps behind my head using velcro straps. It not only counter-balances the headset perfectly, making it less heavy on your face, I have yet to play long enough to wear out the power bank! My longest time in the Q2 was 9-10 hrs with still 20% battery left as well as 2.5 hrs on the headset... (don't judge lol I lead a very boring life lol) The Q3 does pull a lot more power..but it still outlasts me lol.\nYes, the Q3 visuals are slightly better (clearer & brighter), but STILL not $300 worth better. I'm still debating whether or not to keep it or return it.. but for the Q3 price I could get 2 new Q2s! Or just get a new Q2 for $400 plus 3 extra sets of controllers! My Q2 had 256gb storage with over half used.. so of course I couldn't get the cheaper one that only had128gb!! Good job META you really know how to make your money...Grrrrrrrrr!\nHowever, I now have a headset with 512gb, and access to games not available on the Q2. I'm also afraid of Meta slowly fazing out the Q2 like they did Q1.\nI haven't tried any mixed reality using the passthough, so I cant review that part, but the Q3 pass-through is not what they show it to be at all. It's more like trying to see under water. At least it's in color now. I'm not a big fan of mixed reality. I'm in VR because it feels like it takes you away from the real world.. like a little vacation with friends without spending money or getting dressed up or leaving the house! lol I don't want to be sidetracked or reminded of what I need to do in my house LOL.\nThe controller battery doors are much easier to remove now with a push button thing that pops it open. These controllers also have no ring, and are a bit smaller. If you have huge hands itll probably feel like they'd disappear in your hands. I still prefer the feel of the Q2 controllers, especially for Beat Saber & Pistol Whip. I require knuckle grips to play those, which were much cheaper than the Q3 ones.\nThe Q3 will draw a boundary for you, which is great if you are only standing.. or only sitting.. I still have to draw my own since I like to sit and stand depending what I'm doing in vr... but so far, it remembers my setting.\nThe Q3 cloth interface gives me a \"rug burn\" type rash on my face..maybe its an allergy idk. It's a weird material as opposed to the absorbent foam on the Q2, which I LOVED, because it absorbed sweat during my sweaty Beat Saber & Pistol Whip sessions .. and I would just wash it out every night with a little baby shampoo, squeeze it out & hang it to dry overnight. It never fell apart, and was always fresh & clean for the next day. Now, I have to put my old silicone cover on it, which holds in the heat in and fogs up the lenses.. (I have hot flashes 24/7 so it's not fun). (I just ordered a different interface). Or ill have to spend probably 75-100 bucks when/if they make an interface with the little fan attachment. (The one for the Q2 is awesome btw!) So farmers, not only did I have to spend over $700 for this headset with the added 3yr protection, a new interface, I also had to oder new controller knuckle grips that come attached to new battery doors. Thankfully, I had the option to make 12 no-interest payments over a year!!\nI'm praying these controllers will not drift like the Q2. Although, I take way better care of my Q3 after the lessons learned lol.\nThat's it so far. I'll add to this as time goes on.\nIn closing, I highly recommend getting either headset you can afford! No matter your age!! (But please..not for kids under 13! Do your research on that!!) VR is great for socialization, and exercise!! It's not only a game changer.. its a life changer! Don't listen to all of the negative Nellie's out there who just hate the Zuck lol.. to me it has nothing to do with him. It's all about what experiencing VR has done for me & my family!!\nPS: 2 1/2 yrs ago, while my 82yr old Dad was still alive, I brought my Q2 to him at his nursing home. I showed him so many things he LOVED IT! He loved exploring fish, dolphins , & prehistoric fish in the depths of the ocean..fed & played with dolphins .. traveled to places he'd been to while in the army, even shot virtual army weapons and went hunting! I believe they should have vr headsets available to all patients in nursing homes & hospitals..or homebound patients or whoever else doesn't have the privilege of leaving their home at will! It can breath new life into everyone♡",
                "9": "Buy the Quest 3, DO NOT BUY THE QUEST 2. I still use my Quest 2 it's great but I don't care how cheap it is, the Quest 3 is that much better in both performance and visuals. Even games not updated still look and play smoother. The Quest 3 is good enough to get into VR gaming without a PC. The Quest 1 felt like a gimmick , the Quest 2 was good but still felt compromised but the Quest 3 (while obviously not as a good the average PCVR gaming pc) is able to get much closer and provide a PCVR like experience on newer games. Mixed reality was not something I was interested in but after trying it I think it's awesome, even if you consider it a gimmick it's very cool and fun tech. As someone who really only cared about PC based VR gaming I've been very impressed with the Quest 3. After going on a VR binge in 2019 and some of 2020 I've mostly only played VRChat now but because of the Quest 3 I started exploring VR games again trying out new and old games and even mixed reality stuff too. It's that good but I'd recommend an aftermarket headstrap. The included headstrap seems pretty bad but if you fiddle with it A LOT it can get comfy. Also I returned my 128GB model and bought the 512GB one. It should not cost that much more in price but honestly there's so much cool stuff and games are slowly getting bigger. If you have fast internet , you can buy the 128GB and be fine.\n\nThere's tons of amateur and professional unboxing videos of the Quest 3 that you can look at if you want to see what it looks like. As for what it's like to buy and own it? It's amazing.\nBackground info: I've been a computer based VR player since 2017 when I got the original Oculus Rift also known as the CV1 on a Black Friday sale. Since then I've bought an Index in 2020 with vive trackers for full body tracking, a Quest 1 as a backup headset, a Quest 2 and now a Quest 3. I have about 6000 hours in VR 5000 of that is in VRChat.\nReview: The Quest 3 is incredible. It's my first VR headset that uses pancake lens and it's beautiful. I dabbled in standalone gaming on my Quest 2 with games like Resident Evil 4 VR and Iron Man VR which were both great. Iron Man felt a little held back resolution wise with aggressive foveated rendering BUT THE Quest 3 fixes that mostly with higher resolution in literally everything. Everything from the interface to all old and new games feel snappy. I started playing mixed reality mini games like the Ghost Busters one and Synth Riders and the free built in Alien one and everything has been super cool. it's all surprisingly fun. Audio is also great, about as good as the Index. The whole thing feels more reliable though as my Index cable is annoying with how heavy and thick it is. I'm on my third cable in 3 years and still the Index needs to be unplugged sometimes to make it work. I've had no such problems on my Quest 2 and Quest 3. The only reason I still use my Index is for easy full body tracking in VRChat otherwise I play everything on my Quest 3.",
                "10": "As an enthusiast of cutting-edge technology and immersive experiences, the Meta Quest 3 128GB has completely redefined my perception of mixed reality. This powerful headset delivers a breakthrough in the realm of virtual experiences, seamlessly blending top-notch hardware with an extensive content library to provide an unparalleled journey into the world of virtual reality.\n\nThe Meta Quest 3's 128GB storage capacity is a significant upgrade, offering ample space for a diverse range of applications, games, and experiences. This expanded storage allows users to curate a personal virtual library without the constant need to uninstall and reinstall content, providing a seamless and immersive user experience.\n\nMeta Quest 3 introduces breakthrough mixed reality technology that sets it apart from its predecessors. The combination of improved optics, enhanced processing power, and intelligent tracking systems results in a more realistic and immersive virtual environment. The visuals are sharp, colors are vibrant, and the overall clarity contributes to a heightened sense of presence.\n\nThe untethered design of the Meta Quest 3 enhances the sense of freedom in virtual reality. The absence of cables allows users to move and interact with the virtual world without constraints, providing a truly immersive and unencumbered experience. The wireless setup contributes to a sense of presence and freedom that is crucial for a compelling mixed reality experience.\n\nThe Meta Quest 3 boasts powerful internal hardware, ensuring smooth and responsive gameplay. From graphically demanding VR titles to intricate interactive experiences, the headset handles it all with ease. The improved processing power is particularly noticeable in the reduction of latency, creating a more comfortable and engaging virtual reality experience.\n\nThe Meta Quest 3 benefits from an extensive content library, featuring a diverse range of applications, games, and experiences. From educational apps to thrilling games and social experiences, the headset caters to a broad spectrum of interests. The ever-expanding Meta Quest store ensures that users have access to a constant stream of fresh and exciting content.\n\nNavigating the Meta Quest 3 is made intuitive and user-friendly with its well-designed interface and controls. The responsive touch controllers and ergonomic design contribute to a seamless and immersive interaction with the virtual environment. The learning curve is minimal, making it accessible to both VR newcomers and experienced enthusiasts.\n\nThe Meta Quest 3 places a strong emphasis on social VR experiences, allowing users to connect with friends and other users in virtual spaces. Whether playing games together, attending virtual events, or exploring shared environments, the headset fosters a sense of community in the virtual realm, enhancing the social aspect of mixed reality.\n\nThe Meta Quest 3 prioritizes comfort with its adjustable head strap and well-distributed weight. The thoughtful design allows users to enjoy extended VR sessions without discomfort, making it suitable for a variety of head sizes and shapes. The comfort factor is crucial for a device intended for prolonged immersive experiences.\n\nThe Meta Quest 3 128GB is a game-changer in the world of mixed reality. With its impressive storage capacity, cutting-edge technology, powerful performance, and extensive content library, it delivers a truly immersive and unparalleled virtual reality experience. Whether you're a seasoned VR enthusiast or a newcomer to the world of mixed reality, the Meta Quest 3 sets a new standard for what is possible in the realm of virtual experiences. It's not just a headset; it's a gateway to a new dimension of interactive and captivating adventures."
            }
        }
    },
    {
        "Product Index": 5,
        "Product Data": {
            "Product Name": "Nintendo Switch™ with Neon Blue and Neon Red Joy‑Con™",
            "Product Price": "286",
            "Product Rating": "4.8",
            "Product Number of Rates": "5,759 ratings",
            "Product Image Address": "https://m.media-amazon.com/images/I/71wpE+ZIehL._SX466_.jpg",
            "Product Description": " 6.2” LCD screen Three play modes: TV, tabletop, and handheld Local co-op, online, and local wireless multiplayer Detachable Joy-Con controllers Nintendo Switch is the home of Mario & friends ",
            "Product Reviews": {
                "1": "The bundle includes everything you need to dive straight into the action: the console, Mario Kart™ 8 Deluxe game, and two vibrant Joy-Con controllers. The Joy-Cons not only add color to your gaming setup but also enhance the multiplayer experience, allowing for spontaneous races with friends and family.\n\nOverall, this bundle is a must-have for Nintendo fans, especially those obsessed with Mario Kart. It's a fantastic package that brings together the joys of gaming, competitiveness, and nostalgia. Whether you're a seasoned racer or a newcomer to the Mario Kart universe, this bundle promises hours of laughter, excitement, and memorable gaming moments. love it",
                "2": "The Nintendo Switch is a triumph of gaming ingenuity. Its seamless blend of versatility, exceptional game library, innovative design, and social gaming excellence make it a must-have for gamers of all ages. Nintendo has once again proven its ability to redefine the gaming landscape, and the Switch stands as a testament to the company's dedication to delivering unforgettable gaming experiences. For anyone seeking a gaming console that seamlessly adapts to their lifestyle, the Nintendo Switch is not just a choice; it's a gaming revolution.",
                "3": "I have wanted a Nintendo Switch for ages, now! I won a Switch Lite a few years ago and that is awesome fun, but nothing better than gaming it on the big screen with family and friends. The Switch does that, as well as personal handheld gaming! It is a wonderful device! Full of exciting and fun games for all!!\n\nI wanted to play the Nintendo classics, old and new versions: Marios'/Kart's, Kirby's, Zelda's, Metroids etc and have fun, easy to play multiplayer games for my family, too! From handheld to the tv or vice versa, in seconds! Easy to use features. Easy to set up! Fast online (servers), swift with the connections! Loads of people are still playing Mario Kart 8 online, too!\n\nA massive, growing library of old and new games!\n\nThis thing is perfect! Buy one! Or more! They connect well!\n\nGood price too!",
                "4": "Bought this for my nephew. He's obsessed with it. Buy one for your nephew. Or your son. Or niece or daughter or everything betwixt all those. Everything bad you've ever done will just melt away in their eyes. Unless they're in their 30s. In that case please buy them a switch and ask them politely to leave. And if they don't well... there's an older definition of \"switch\" that might work better if youknowwhatI'msayin.",
                "5": "I finally bought The Switch. I have NO regrets. I've missed my Mario games. I hated The Wii. This thing integrates between handheld/portable and TV docking station seamlessly. Setting up the account.. downloads.. purchases.. game play is GREAT.",
                "6": "I recently acquired the Nintendo Switch™ with Neon Blue and Neon Red Joy‑Con, and I am thrilled to share my overwhelmingly positive experience with this versatile gaming console. The Nintendo Switch™ offers a truly unique and captivating gaming experience that has exceeded my expectations. Here's my detailed review of the Nintendo Switch™ with Neon Blue and Neon Red Joy‑Con:\n\nVersatility and Portability:\nThe Nintendo Switch™ is a master of versatility, seamlessly transitioning between handheld, tabletop, and TV modes. Whether I'm gaming on the go, sharing the joy with friends, or immersing myself in the stunning visuals on the big screen, the Switch™ effortlessly adapts to my gaming preferences. The lightweight and compact design, combined with the detachable Joy-Con controllers, make it a breeze to carry and enjoy gaming wherever I go.\n\nInnovative Joy-Con Controllers:\nThe Neon Blue and Neon Red Joy-Con controllers are not only eye-catching but also a testament to Nintendo's innovation. These detachable controllers provide an immersive and intuitive gaming experience, allowing me to play with traditional button inputs, motion controls, and even HD rumble feedback. The Joy-Con controllers offer a level of precision and responsiveness that enhances gameplay across a variety of genres.\n\nExpansive Game Library:\nThe Nintendo Switch™ boasts an ever-expanding game library that caters to gamers of all ages and preferences. From iconic Nintendo franchises like Super Mario, The Legend of Zelda, and Pokémon to an array of indie and third-party titles, the console offers a vast selection of games that guarantee countless hours of entertainment. The ability to play both exclusive Nintendo titles and popular multi-platform games makes the Switch™ a true gaming powerhouse.\n\nSeamless Multiplayer Experience:\nThe Nintendo Switch™ embraces the joy of gaming together, thanks to its seamless multiplayer capabilities. Whether through local wireless play or online multiplayer, the console encourages social gaming and fosters friendly competition. The detachable Joy-Con controllers allow for instant multiplayer experiences, making it easy to share the excitement with friends and family.\n\nSuperior Display and Graphics:\nThe Switch™ boasts a vibrant and high-definition display that brings games to life with stunning visuals. Whether I'm exploring vast open worlds, solving puzzles, or engaging in action-packed battles, the graphics never fail to impress. The console's ability to deliver a visually rich gaming experience, both in handheld and docked modes, showcases Nintendo's commitment to quality and immersion.\n\nNintendo's Signature Charm:\nNintendo has a knack for infusing its consoles with a sense of charm and whimsy, and the Nintendo Switch™ is no exception. From its user-friendly interface and delightful sound effects to the iconic characters and beloved franchises, the console exudes Nintendo's unique identity. The attention to detail and the overall gaming experience make it a joy to own and play.\n\nNintendo Switch™ with Neon Blue and Neon Red Joy‑Con is a gaming marvel that seamlessly combines versatility, innovation, and a captivating game library. Whether you're a seasoned gamer or new to gaming, this console offers an experience that will keep you entertained for hours on end. The sleek design, immersive gameplay features, and Nintendo's signature charm make the Switch™ a must-have for any gaming enthusiast.\n\n(Don't forget to explore the Nintendo eShop for downloadable games, demos, and additional content to further enhance your gaming experience.)",
                "7": "This item showed up quickly and was easy to set up. It came half way charged so I was able to power it on. You will need to make a nintendo account that you can sign into and download the game but it is still pretty simple.",
                "8": "I go this for the kids and my husband and for some indoor exercise. Our son set it up but we had a little trouble learning to get it started on our own but once you figure all that out it works well and we all are enjoying it.",
                "9": "Before you buy it, you need to get SD card for this. That is if you want to download more games. I would suggest you get at least 512 GB.\nOther than that, I love it.",
                "10": "I bought for my kids for a Christmas gift this year. When setting it up it's easy and has a bunch of free games to start. I plan to purchase games after they open it in 26 days. I had to create a Nintendo account which is fast and painless."
            }
        }
    },
    {
        "Product Index": 6,
        "Product Data": {
            "Product Name": "Super Mario Bros.™ Wonder - Nintendo Switch (US Version)",
            "Product Price": "59",
            "Product Rating": "4.8",
            "Product Number of Rates": "2,392 ratings",
            "Product Image Address": "https://m.media-amazon.com/images/I/81KYcp48kgL._SX342_.jpg",
            "Product Description": " Find wonder in the Flower Kingdom in the next side-scrolling Super Mario adventure Collect Wonder Flowers for surprising, game-changing effects like pipes coming alive, an enemy stampede, and much, much more Choose from the largest cast of characters in a side-scrolling Mario game, including Mario, Luigi, Peach, Daisy and other favorites Ease into the action with four different-colored Yoshis and Nabbit who can’t take damage Discover new power-ups like Elephant Fruit, which transforms Mario and friends into an elephant that can swing its trunk and spray water ",
            "Product Reviews": {
                "1": "Super Mario is one of the most iconic and beloved video game franchises in the world, created by Nintendo and featuring the adventures of its titular character, Mario. The series has been a cornerstone of the gaming industry for decades, and it has evolved over the years to include a wide range of games across various platforms. Here's a general review of the Super Mario series:\n\nGameplay: The gameplay in Super Mario games is known for its accessibility and appeal to gamers of all ages. It typically involves running and jumping through colorful and imaginative worlds, overcoming obstacles, collecting power-ups, and defeating enemies. The gameplay is easy to pick up but offers depth and challenge for those looking to master it.\n\nGraphics and Art Style: Super Mario games have consistently featured vibrant, well-designed worlds and characters. The art style varies from game to game, but it often includes whimsical and charming visuals that are visually appealing.\n\nStorytelling: While the overarching story in most Super Mario games is relatively simple (Mario rescuing Princess Peach from the clutches of Bowser), the charm lies in the creativity and humor that Nintendo infuses into each title. The games often feature memorable characters and plot twists.\n\nInnovation: The Super Mario series has been at the forefront of innovation in the gaming industry. It introduced concepts like side-scrolling platforming, 3D platforming, and motion controls (with titles like Super Mario 64 and Super Mario Galaxy). These innovations have set standards for the industry and influenced countless other games.\n\nMusic and Sound: Super Mario games are also known for their catchy and memorable music. Composed by Koji Kondo, the series has produced some of the most iconic video game tunes, including the original Super Mario Bros. theme.\n\nMultiplayer and Cooperative Play: Some Super Mario games, like the New Super Mario Bros. series and Super Mario 3D World, offer multiplayer and cooperative gameplay, allowing friends and family to join in the fun.\n\nLongevity: The Super Mario series has maintained its popularity for decades, and Nintendo continues to release new titles, ensuring that both longtime fans and new players have a constant stream of Mario adventures to enjoy.\n\nCritic and Fan Reception: Super Mario games have consistently received critical acclaim, with many titles earning high review scores. They have also garnered a massive and dedicated fan base.\n\nOverall, the Super Mario series is a testament to the enduring appeal of video games. Its combination of accessible gameplay, charming characters, and innovation has made it a staple in the world of gaming. Whether you're a longtime fan or a newcomer, there's likely a Super Mario game that will provide hours of entertainment and joy.",
                "2": "Having grown up on the NES and SNES, I was happy to see an entirely new 2D entry in the mainline mario series. After the phenomenal Super Mario Odyssey easily became my family's favorite video game during the pandemic, we were somewhat disappointed with the remakes that have been released since. It was an easy choice to pre-order Super Mario Wonder, but I was doubtful the experience could compare to Odyssey, despite more emphasis on co-op play.\n\nGameplay:\nFrom the start screen, the essence of Mario games is captured perfectly in Super Mario Wonder. Levels oscillate between familiar terrains and novel landscapes. Most mario games offer something new that at first seems like it will disrupt the always-solid platforming experience and genius level design hallmark to 2D mario adventures. Wonder includes several new power-ups, an overwhelming number of one-at-a-time badges provide a small change in-stage, and the wonder flower induces brief level-warping or mario-warping mini-challenges. None of these are affect the game on the level of Oydssey's Cappy or Mario Sunshine's FLUDD. However, they are all interesting and worthy additions. They also allow for a solo base difficulty that is decidedly more challenging (as you get further into the game) than many other 2D Mario games. Yet, the game (as you would expect) is adaptive to a wide range of player skill because of the co-op, invincible characters (that don't need to be unlocked), new power-ups, and badges. Still, I do miss the simplicity of the platforming challenges hallmark to Mario games, which aren't quite as much on display here as compared to collecting star coins in New Super Mario Bros.\n\nGraphics:\nGraphically, the game delivers as much as the hardware allows. Detailed environments and distinct aesthetics for each world are evident. It can be a bit busy, but always fun. The level of polish is as good as any Mario game, which already sets the bar high. Character animations, character model design, enemy design, and effects, all add greatly to the experience.\n\nControls:\nThe controls, for the most part, are what you'd expect from a Mario title: reliable. Yet, during some platforming, my kids experienced issues they blamed on lagging response. It could have been that they were sitting too far from the Switch or that they are kids. I didn't notice any issues with input lag or imprecision. I also love that Nintendo just 2 core (run and jump) buttons are needed most of the time, supplementing with the top-right bumper button (or, alternatively, shaking the control) on occasion.\n\nCo-op:\nThe co-op mode is where \"Super Mario Wonder\" truly attempts to bridge the generational gap. Collaborating with my children, combining our abilities to face challenges, is a great way to spend time together. The characters that don't receive damage from enemies make it easy for novices to contribute to the progress and keep up with more advanced players.\n\nOverall Assessment:\nSuper Mario Wonder delivers on combining many of the most beloved and nostalgiac components of former 2D Mario adventures while avoiding the trap of feeling like an updated version of a previous game. My kids enjoyed the new features more than I did, with my 8-year old laughing hysterically every time I hop along as a crouched elephant Mario. I'll update as we continue our adventure...",
                "3": "Mario has always been present in my life. My first serious interactions that my memory recalls is from Super Smash Bros Melee, he was the headliner, the face of Nintendo, but I still would rather play as Link. I dabbled here and there with the 2D games often getting too frustrated with them and not feeling enough of a hook to continue with the harder levels, let alone beat the whole game.\n\nMy first Mario game that I really played through and throughly enjoyed was Mario Odyssey. A great 3D plat-former. I wouldn’t put it up there with my all time favorites but I had a great time with it.\n\nWhen Nintendo revealed Super Mario Bros Wonder back a few months ago, I shrugged it off and made no plans to play it (I was salty about the lack of a Wind Waker port announcement being made on Switch and still am). But I had been hearing some buzz about it and thought I’d pick it up as a birthday gift to myself sense I hadn’t been playing any games as of late.\n\nAll that to say, this game is simply wonderful. “Wonder” was the perfect title for this game. It had such a sense of joy, and glee about its creativity and is a celebration of what Mario is. You really get a sense of how much everyone who worked on this game really love what they do. They made something truly special.\n\nThe gameplay is tight, responsive, challenging, and a blast to play. The level design is out of this world creative, second to none, can’t think of a game that has done it better, the graphics are gorgeous, and the music is perfect.\n\nI’m not the best at 2D platformers so I struggled with a few of the levels, and I can’t really compare the difficulty level with this and other Mario’s, but I’m going to have to go back and play some other 2D titles now.\n\nOverall, I highly recommend this game. It’s a joy to play and really brings back what games are supposed to be about: fun gameplay and a fun experience with none of the strings attached like the rest of the gaming landscape right now.\n\n10/10",
                "4": "Introduction:\nAs a self-proclaimed cool dad with a lifelong love for video games, I was excited to dive into the Mario Wonder Switch Game. Mario has been a part of my gaming journey since I was a kid, and I couldn't wait to see what this new title had to offer. In this in-depth review, I'll share my insights and experiences playing the game from a cool dad's perspective.\n\nGameplay and Mechanics:\nThe gameplay of Mario Wonder Switch is nothing short of magical. It captures the classic Mario charm while introducing innovative mechanics. The variety of power-ups, from the Super Mushroom to the new Wonder Suit, adds a layer of fun and excitement. The controls are responsive and intuitive, making it easy for both veteran gamers and newcomers to enjoy. The level design is masterful, offering a balanced blend of nostalgic elements and fresh challenges that keep me and my kids engaged for hours.\n\nGraphics and Art Style:\nThe visuals in Mario Wonder Switch are a visual treat. The vibrant, colorful world of the Mushroom Kingdom is brought to life with stunning detail and animations. The game's art style combines the best of modern graphics technology with the timeless charm of Mario, resulting in a delightful visual experience that leaves a smile on my face and my kids' faces.\n\nStory and Adventure:\nMario games have never been renowned for their intricate stories, but Mario Wonder Switch delivers a fun and engaging narrative. The story, while simple, adds a layer of motivation to the game. The adventure takes you through various captivating worlds, each brimming with unique challenges and quirky characters. The game keeps the excitement alive by introducing twists and turns that you won't see coming.\n\nMultiplayer Fun:\nOne of the highlights for a cool dad is the multiplayer experience, and Mario Wonder Switch doesn't disappoint. The cooperative multiplayer mode allows my kids and me to team up and enjoy the game together. It's a fantastic way to bond with them while solving puzzles, battling foes, and working as a team. The competitive mode is also a blast for some healthy family rivalry.\n\nNostalgia Factor:\nBeing a lifelong Mario fan, I appreciate the nods to the franchise's history. Mario Wonder Switch includes various references and throwbacks to earlier titles, making it a nostalgia trip for me. It's a pleasure to share these moments with my kids and tell them about the good old days of gaming.\n\nReplay Value:\nThe game's extensive content and collectibles add significant replay value. Exploring every nook and cranny, hunting for Power Moons, and trying to achieve 100% completion is a journey that keeps the fun going long after the main story is completed. It's a game that we keep coming back to, providing lasting value and entertainment.\n\nConclusion:\nMario Wonder Switch is a marvelous addition to the Mario franchise, and it has certainly lived up to the hype. As a cool dad, it's been an absolute joy to share this gaming experience with my kids. The gameplay, graphics, story, and multiplayer options make it an all-around fantastic game that bridges the generation gap. Mario continues to be the ultimate family-friendly game, and Mario Wonder Switch is no exception. It's a game that cements Mario's status as a beloved icon for all ages.",
                "5": "OK so I love this game, it brings a lot of new art and fun to the table. It does seem, at least to me, to be very easy, but at the same time it's possible I've just gotten way too good at Mario games. But this may mean no matter what skill level you have or don't, you will have a lot of fun and for some of you, you may have a bit of a challenge. I've yet to try multiplayer as I have no friends (JK) but I understand it's like the NSMB multiplayer except you can't throw your friends or bump into them, so I dunno. In Single player, you can play whatever character you want, so if you want to go through the whole game as a pretty Princess who turns into a Princess Elephant, you can do that. They have some easy mode players as well that don't die when hit by enemies, and if you use them, that can be our little secret. I also want to point out that this game is roughly the same size as my all time favorite, Mario 3, even though somehow it feels like I'm zipping through this game really fast compared to that one. I did the comparison so you didn't have to. There are a good number of regular levels + some bonus levels, like the one where you race a caterpillar for some reason. There's also some funky stuff that you may already know about, so I'll let you just discover all that on your own.",
                "6": "So I have to say that I was almost disappointed months ago to learn that Nintendo was making another 2D Mario game. The first thought I had was why are they not making a Super Mario Odyssey II!? Which I’ve still not given up hope for. When I discovered it was going to be a 2D at this point the trailer had not been released so we didn’t know it was the Wonder version & just how phenomenal it was going to be. I was assuming it would be something similar to the Super Mario Bros. U Deluxe which I lost interest in. As soon as the trailer for Wonder was released I said to my husband I’m buying it. Pre ordering it right now. Just prior to seeing the trailer I had told him I wouldn’t be buying the new 2D game because I was that upset it wasn’t Odyssey II or any 3D Mario game. I’m so glad I decided to purchase this game. First I must mention that it was delivered to our door the SAME DAY the game was released. My husband & I played it immediately & were instantly obsessed!!!!!! This is the most beautiful Mario game to date. I love it equally as much as I do Super Mario Odyssey which is saying a lot. I wish it was just as long as Odyssey though. So I guess that would be my only complaint. While it’s definitely not a short game - I do wish it was longer because I love it that much. I just never want it to end. I’d say many of us are still hoping for an Odyssey II one of these days but this will definitely help in passing the time while the world waits for it!!! Get this game. You won’t be disappointed. 10/10",
                "7": "Knowing Nintendo and what they do, I want to make sure I acquire an actual physical copy of their first party titles. This is a great game. No more \"new\" deviations to the Mario 2D platform games. It has a fresh look and gameplay. There is plenty to do in the game and great for picking it up and playing every now and then without having to understand some complicated storyline or starting the entire game over.\n\nI have just one gripe. There is a slight bit of disappointment when I rip off the plastic wrapping and opening the game case in anticipation. There is no manual, no map, no poster, no swag. There are clips for it but nothing there. I open it and there's just a tiny game card/cartridge at the bottom. It just feels empty. At least put some kind of advertisement for your other games in it, Nintendo. It's a missed opportunity.",
                "8": "The graphics are a visual treat. The vibrant colors and detailed landscapes make every level a work of art. It's like playing in a living, breathing cartoon world, and it's utterly captivating.\n\nThe gameplay is where the real magic happens. Whether you're jumping on Goombas, collecting coins, or discovering hidden power-ups, it's an exhilarating experience that takes me back to the nostalgia of my childhood. And the controls on the Nintendo Switch are so intuitive; it's gaming bliss.\n\nOne of my favorite scenarios is playing this game with friends. It's pure multiplayer fun! Competing in challenges, cooperating on tough levels, or simply exploring together - it's a blast every time.\n\nThe replay value is outstanding. With so many levels and secrets to uncover, I find myself coming back for more, each time with a sense of wonder and anticipation.",
                "9": "This is so fun!!! Last year I got this deep, insane itch to play Super Mario Bros. on 3DS, which is what I grew up playing. However, after digging through my games, I couldn't find it. My local game store has the game marked up so high that I decided I would rather cry and keep my money. So when Nintendo came out with this game this year, I jumped for joy. It has so many cool features, including having different gaming experiences with each character you play as, which results in essentially an infinite number of different playing experiences. So cool. Buy. It.",
                "10": "My sister and I have been playing Mario Bros on various platforms (Wii, wiiU, switch) since we were very young. We have completed all of them and are always looking for new challenges that are multiplayer. While most of the levels were easier than the average super Mario bros levels, there were quite a few levels that would definitely make our list of most challenging levels (the top level being 9-2 of super Mario bros deluxe). The concepts were new but easy to understand and reminded us of the joy these games brought us growing up. Whether you are debating on getting this for your kids or getting it to play as an adult, I would definitely add this to your collection regardless of your skill background."
            }
        }
    },
    {
        "Product Index": 7,
        "Product Data": {
            "Product Name": "Nintendo Switch™ - OLED Model: Super Smash Bros.™ Ultimate Bundle (Full Game Download + 3 Mo. Nintendo Switch Online Membership Included)",
            "Product Price": null,
            "Product Rating": "4.8",
            "Product Number of Rates": "33,672 ratings",
            "Product Image Address": "https://m.media-amazon.com/images/I/81VN1ingNjL._SX342_.jpg",
            "Product Description": "    ",
            "Product Reviews": {
                "1": "I'm old. I know nothing of these things. I started to \"google\" and \"research,\" (WTF happened to the trip to the library; pouring through the books and being b***ched out by the Gestapo librarian... these kids are missing so much...) and i found this one seemed to be what I wanted to \"gift\" my grandson & son. We all live together, vicariously and pseudo-parasidically, and some diversion is in order. SOOOO... g'ma is springing for some entertainment. Son Prince informs me what I want is *this* which is good cuz I already ordered it cuz I was running out of time and I dont like to shop, but \"google\" said this one was best for our age group. (4 year old, and two adults that act 4). It came, and I asked said Son set it up and make sure it worked and was what they wanted. Himself and Herself played the godsdamned thing until 4:00am making all varieties of shrieks and gleeful commentary (small house, something of a typical disturbance) and we're set for the \"big day.\" Strongly recommend. I need a drink.",
                "2": "This is my first gaming console after a long time, before I played on old PS and Nintendo 2DS, but this OLED switch is day and night difference. I gifted this to my 9 years old daughter and a 5 years old son. They're having party at home now!! Choosing a gaming console appropriate to audiences I got (my kids of course), was no brainer 1/Since this console can be played handheld so travel friendly with kids 2/Can be easily switched to TV for big screen experience 3/Multiplayer games are fun because you have two joycons 4/Light weight on the hands 5/Joycons are most suitable for your kids, however, both Joycons can be clubbed to use as full controller on Joycon Grip 6/Docking is breeze 7/Longer play time on switch screen 8/Kids can use switch as Table Top mode (use the inbuilt screen and put it on table and play when on travel, fun to have both kids sit side by side in a car 9/The Dock is light weight and HDMI, LAN and power adapter can be connected 10/You can charge with USB-C while on travel.. Now few things can be improved 1/Joycons can be confusing sometimes, the buttons on both Joycons play imp role so kids are confused which to press when on mutilplayer mode, so it can be simplify 2/Docking is so light weight that it is being dragged sometimes if you connect with TV on HDMi cable, so need extra few grams weight to stay put properly 3/Games are insanely pricy, I mean almost all Mario games are about 60 bucks a game!!! So buy the switch, and then buy those costly games!! No discount I saw so far on Mario games 4/I need to check the switch specs, but I am sure there is no 4K support even I connected to my Sony Bravia x90K 85\" 4K/120 Hz HDMi 2.1 input, used HDMi 4 input which is 4K/120 Hz compatible. 5/Sound on switch is alright, well, good that your kids won't annoy you while they play on switch and not on TV 6/Internal memory is adequate, only 64GB, initially okay but can't put more games if you gonna install more than 15 (3 gb per game), should be alright if kids want to experiment free games and just recycle them.\n\nNothing major negative though, all good so far! Hopefully you will enjoy your brand new console! So far I love it since my 5 years Son can easily handle without much adult supervision!!! Go for it and yes, it brand new item!!!",
                "3": "I recently purchased the Nintendo Switch OLED from Amazon, and it's fantastic! The OLED screen is a game-changer, providing vibrant colors and crisp visuals that elevate the gaming experience to a whole new level. The difference is so remarkable that there's no going back once you experience gaming on an OLED screen. The device's build quality, enhanced audio, and improved ergonomics make it a joy to use for both casual and serious gamers. I highly recommend the Nintendo Switch OLED for anyone looking to upgrade their gaming setup!",
                "4": "I have wanted a switch for a while now, but didnt really want to spend the money. I saw this Mario red edition however and had to have one! I have been having a great time with it and look forward to gaming with my kids when they get theirs on Christmas day. Its a super fun console, very adaptable and has fantastic accessories, the portability is awesome and the ability to play offline is awesome. I think theres something charming about physical media, but you can choose to be all digital if you like. I think theres something for everyone with Nintendo and its hard to go wrong with classic Nintendo titles like Mario and Zelda!",
                "5": "If you would have told me 40 years ago I'd be playing games that look like this anywhere I wanted, I would have thought you were crazy (Let alone come home and finish playing it on my TV!) With an amazing library of games and accessories, I'm having an absolute blast playing my switch. Having an OLED screen is just the cherry on top of the Sunday!",
                "6": "My girlfriend has been asking for one of these for a while now and was finally able to get it at a discounted rate for Black Friday. Came with everything it said it included. I just wish the back was etched with the super smash characters that the old version came with.",
                "7": "Sin duda la pantalla oled es un plus con respecto al modelo anterior, tengo ambos y no hay punto de comparación, da mucho gusto poder jugar en una pantalla mas brillante y la mejora de la bisagra de apoyo también es un plus",
                "8": "",
                "9": "This is the new OLED version of the Nintendo Switch. Decided to replace his old Switch that cracked from an accidental drop one day. Turned out to be the perfect B-day gift. He loves it! The screen is bigger and the colors are superior in every way to what his old Switch looked like. Amazing how much more vibrant the games look with this new version. All his little buddies want one now too!",
                "10": "At first I was worried because of the other reviews but the OLED switch I received was the US version with the U.S. charger. (Some reviews mention they received a EU charger port, but I didn’t have that issue) The console has run just as I expected and I’m very happy with it!",
                "11": "The console came in perfect condition with everything that is required to function properly, the screen looks greatly improved in size and definition. This is the best Switch with a longer battery life for those who like to play on the go."
            }
        }
    },
    {
        "Product Index": 8,
        "Product Data": {
            "Product Name": "Super Mario RPG - Nintendo Switch (US Version)",
            "Product Price": "55",
            "Product Rating": "4.8",
            "Product Number of Rates": "442 ratings",
            "Product Image Address": "https://m.media-amazon.com/images/I/81pUNVRNnFL._SY445_.jpg",
            "Product Description": " Jump through a colorful world and give attacks some extra oomph in battle! Explore the vibrant environments with your party and jump towards your next goal! Run into monsters to enter turn-based battles with your party of three. Press the button at the right time for a satisfying dose of extra damage or helpful guard. ",
            "Product Reviews": {
                "1": "This is an absolutely phenomenal, hyper faithful, and even improved version of Super Mario RPG's Legend of the Seven Stars.\nOne of the greatest RPGs ever made.\nIn some ways, it's probably the greatest Mario game ever made.\n\nThis remake only changes one tiny relatively insignificant thing in a way that I find questionable, it changes several things in ways that make sense and are probably objectively better, and then it makes a number of dramatic improvements that feel like they should have been there all along in the original game from 30 years ago.\n\nEverything looks gorgeous.\n\nThe game is absolutely delightful and hilarious.\n\nThe music is iconic and infectious.\nYou're going to hear it in your brain for the rest of your life.\nAnd that's a GREAT thing.\n\nIt brings life to the Mushroom World In a way that few games ever have, even in the 30 years since this game originally came out.\nIt makes Mario into a fun character. It gives personalities to icons like Peach and Bowser.\n\nThis is the game that introduced various features of these characters that we would go on to see in later games, especially stuff like Peach being equipped with umbrellas and frying pans, or treating fireballs as sort of a default power that Mario has up his sleeve, even without picking up a Fire Flower (as we see in Super Smash Bros).\n\nThis game also introduces a number of unique new characters who are absolutely fantastic, and deserve to be in dozens of more games.\nGeno, Mallow, Croco, Booster, Johnny, etc.\n\nIn a year when The Legend Of Zelda:Tears Of The Kingdom came out, Super Mario RPG's remake ended up being my Game Of The Year.\nAs great as TOTK is, and as much crazy big ambitious stuff and complexity as it rings to the table, it falls faaaaar short of achieving its true potential, and there are huge swaths of that game that feel lacking and incomplete.\nSuper Mario RPG does not have that problem for even a second.\nEverything in Super Mario RPG feels like it is living VERY close to the maximum potential of the Mario franchise.\nEvery second is fun. Everything is interesting. The whole world is full of stuff to find and do, and people to talk to, and silly jokes and gags, and interesting little story bits.\nHow many dungeons and boss fights are there in Zelda TOTK? Maybe 10 if you count one instance of each species of big regular monster (Ganon, Temple bosses, Hinox, Gleeok, Talus, Flux Construct, etc?)\nI have literally no idea how many boss fights Super Mario RPG has.\nThere are so so many.\nSuper Mario RPG has like 4-5 boss battles JUST within the tutorial area. I can think of at least 30 bosses in Super Mario RPG, and I'm sure I'm forgetting a bunch.\n\nIt's not a perfect game, but for a game that came out 30 years ago, and has only been minimally upgraded in this remake, it is SHOCKINGLY close.\n\nOf all the Mario games that exist, this one is One of the must-have games in the series, alongside: Super Mario World, Super Mario Bros 3, Super Mario Sunshine, Mario Kart 8 Deluxe with all the DLC, Super Mario Bros Wonder,.....and the remake of Super Mario 64 that they absolutely desperately need to make.....\n\nThis is better than the original Mario Bros, the original Super Mario Bros, Super Mario Bros The Lost levels, Super Mario Bros 2, Super Mario Odyssey, Super Mario Galaxy, Super Mario Galaxy 2, all the Paper Mario games, all the Super Mario Land games, all the Mario Party games, almost all of the Mario Kart games, all the Mario sports games, etc etc etc.\n\nThis belongs in that core handful of Mario games that every gamer needs to play to understand how phenomenal Mario can truly be.\n\nIt's a tiny thumbnail-sized game cartridge full of happiness.\n\n🤷🏻‍♂️",
                "2": "This was my first RPG I remember playing back in 1996. It launched my love of turn based role playing games. I think I beat this game a few dozen times on the Super Nintendo when I was 12. I have very fond memories of this game. So when I heard it was being released on the switch I was very excited.\n\nI broke one of my cardinal rules of game buying with this. I pre-ordered it. Nintendo rarely has launch issues with games but I still try to avoid pre-ordering games. But I couldn't help myself with this one.\n\nThe game is excellent. They upgraded the graphics which may have taken away some of the charm of the original but I think it looks great. They even kept in the 2d OG mario Easter Egg in Boosters Tower, and pixelated Culex boss. The game play was exactly as I remembered it and still a joy to play.\n\nNintendo made a few quality of life improvements to the game. First they created a Breezy mode which makes the game just a bit easier. It lifts the item cap, makes the timed attack window larger and more forgiving, and makes the enemies easier (I have my 6 year old playing on this setting).\n\nOther QOL improvements include adding an icon to help with timed attacks. A chest in Mario's house to carry extra items where in the original they would just be lost. The game now auto saves pretty frequently (usually as you enter a new area), so you don't have to search out a save location. They also added a upgrade to the signal ring that makes it easier to find hidden treasures, that can be acquired later in the game. They also added post game play, making the bosses more challenging and adding new weapons and gear.\n\nMost of the online reviews to this game forget it's an introductory RPG meant for children. They nitpick and complain about the lack of challenge. Super Mario RPG is a fantastic game that will take around 13 hours to beat, but it's a great 13 hours. If you played this game in the 90s get it. If you have a child and are looking to get them a forgiving turn based RPG to learn, get this game. If you are looking for 13 hours of fun without the grind of games like Final Fantasy, get this game. If you want a challenging grueling slog that will take hours off your life and leave you angry most of the time, get Dark Souls.",
                "3": "If you are expecting a typical side scroll 2D jump, jump, jump Mario game, you will be disappointed (watch the trailers).\n\nBasic Plot: Mario and his team must join together and save all the people in the mushroom kingdom from the evil Smithy, a monster who destroyed the star road so that people’s wishes will never come true (simplified version).\n\nGeneral review: The game stays true to the original SNES title with minor changes and quality of life improvements. The game looks fantastic and plays true to the original. The plot and story are much more complex compared to typical Mario saves Peach games. The characters are extremely unique and bring a whole lot of personality to the Mario world and characters we love. It is not an open world game, but there are still quite a few areas to explore with secrets and treasures to find.\n\nGameplay: The fight sequences use a turn based style where the three people in your party take turns to attack before your enemy (s) will have their turn to counter attack (simple explanation of it). The turn based style can be repetitive and boring if you are not accustomed to this gameplay or looking for something more fast paced.\n\nGameplay: This is an RPG so you do gain experience points as you slay enemies and level up your party members. When you level, you will have 3 options to pick from: physical attack/defense, magical attack/defense, or health/hp. Whichever you pick, the stats within that category will increase. For an RPG, it is a very simple leveling system and easy to understand without getting overly complex.\n\nMy experience: Personally, I played/beat the original SNES countless times and was able to beat this remastered version to 100% within 12 hours… but again, experience was on my side. I would say for someone new to this, it could take them 10 - 20 hours - a shorter and easier RPG with a captivating plot.\n\nFinal thoughts: It is an easy RPG for experienced players but you play for the story (or nostalgia), not the difficulty. If you are looking for a good, easy introduction to RPGs, this is a good game to start with for not being overly complicated. If you do not like turn based attacks, RPGs, or just looking for a typical fast paced challenging Mario game, this is not the game for you.\n\n5 stars for a 1-1 remaster of the original (with additional, new gameplay content) and what I expected the game would be.",
                "4": "The developers of this game knew exactly what it would take to please the fans of this game. Simply put, this game is the best remake that I have played in the past couple of years. It has so much love poured into it, every detail that I expected to be here from the original game is here- and additional content. I was incredibly scared that the hype for this game was going to end up causing it to be a bad game, but that is not the case.\n\nThis is a fantastic game that caters to both fans of the original game and those who are wanting to get into RPGs. I have seen several 1 star reviews, and to be completely honest those reviews seemed to have come from those who have never played an RPG before and expected simply another Mario game coming into this. I can't think of anything that this game doesn't improve upon from the original game. The RPG mechanics are engaging, even difficult at times with having the player time certain actions within battles to drastically change the gameplay. However, it does a fantastic job with the ! indicators telling the player when to properly time their button presses.\n\nThe story is of course a remake of the original title on the SNES, however I believe that its humor still stands today. I can't really say many games today make me laugh the way they intended or at least without a slight awkward feeling at a forced joke, but this game actually makes me smile more often than not. This game has some seriously funny moments, and the modernized visuals make scenes much more entertaining.\n\nThe only negative element I can even come up with for this game is the slight frame drops when the scene gets too intense with effects and too many models. Aside from that, the game runs at seemingly a solid 60 fps, with 30 fps for the cutscenes. Aside from the random moments of lag, the game is beautiful and runs fantastic.\n\nI without a doubt recommend this game.",
                "5": "This is nearly a 1 to 1 remake of the original Super Mario RPG game. The music remaster is beautiful and you can even opt for the original soundtrack in the settings. But the remaster of the music is so good you may not want to. All the little things you may remember (if you played the original) are still there. The hidden block you only have one or two opportunities to grab in the Mushroom Kingdom... Link and Samus snoozing at the inn.\n\nWhat they did is they recreated the entire game with updated HD graphics. But kept Mario's pudgy little design the same. The \"cutscenes\" have been replaced with full rendered cutscenes that pan down to in game engine graphics instead of just watching in game graphics move about to act out a scene.\n\nThe best change though is the post game content. Rematches with all the bosses (story element explains why) and they are much tougher the second time around. New \"ultimate\" weapons post game and even some new super bosses to use those shiny new weapons on.\n\nThey pretty much kept the original experience until you beat the game. After that, they gave you more to chew on as additions. A bestiary. A music player. In game stats. Super bosses, rematches, new gear.\n\nThis is how you do a remaster. A proper remaster.\n\nI truly hope they use all this effort to give this game a long overdue sequel. Because it is one of the best Mario games out there. Paper Mario and the Mario + Luigi games can't hold a candle to this.",
                "6": "Super Mario RPG is nearly a 1:1 remake of the original Super Nintendo game in just about every way you could think of. The original OST is included as an option as well. Some subtle changes were made to combat to make it a bit easier for newcomers and just enough changes for veterans to keep them on their toes. The Unity Engine provides excellent graphics and lighting, with vibrant colors and just pop off the screen. If you have an OLED Switch or and OLED TV, you will really be able to see how good it looks. The charm and silliness of the original game are 100% intact and it is sure to become part of the discussion of great remakes/remasters for years to come.\n\nFor anyone looking to take a trip down memory lane or even for the newcomer, this game is a masterpiece that everyone should be able to enjoy. Grab a physical copy of this game before it disappears and becomes impossible to find.",
                "7": "There will, no doubt, be those who disagree with this sentiment, but as someone who dearly loves the original game, and has played through it several times over the course of my life, THIS is what every remake of any game should aspire to. It keeps faithful to the original game, while improving on it in many ways. Some fights feel easier, while others feel harder. Parts of the game I would have sworn were longer are now shorter. There are cutscenes that add more to basically all of the characters, the updated graphics keep all the charm of the game's style while looking great, and the ending cinematic made me smile like a little kid. One of the best gaming experiences I've had in a long time, brought by a brilliant remake of an already excellent game. I'd give it more than five stars if I could. Seven would seem an appropriate number.",
                "8": "Super Mario RPG is an SNES classic that most RPG fans love. The game is essentially the same as it was back in the day, but with some added combat elements that make the game even easier than it already is. Visually looks great but the frame rate drop on this is unacceptable in my eyes. It was the same for Zelda Links Awakening, and I just don't get why they can't have a buttery smooth 30-60fps when we get that in other games like Mario Kart. Still, this is Nintendo history reborn, and should be played by every RPG and Mario fan.",
                "9": "The problem with remaking video games is the design philosophy around what a remake should even try to accomplish. Video games just don't age as well as products from most other mediums. True, I love video games and they are my favorite way to pass time, but game mechanics, graphics and interactivity can resonate with older audiences that hadn't encountered them before while newer ones will often at best find them quaint and others find them cumbersome. Should a remake essentially tart up the aesthetics and keep the core gameplay the same, winning over the original audience but potentially losing the new? Or should a remake shake things up, evolving what was rusty from the ground up, risking the loss of what made the game special to begin with?\n\nSuper Mario RPG is unabashedly in the first camp. It is very safe. It introduces some minor mechanics like the triple attacks that don't factor much in moment to moment gameplay at all, and adds some boss rematches and such. It sticks close to the original, remaking the graphics and music but not really shaking up the script, the general story, the turn based gameplay or the bad platforming (for a Mario game, even an RPG, that's honestly a serious flaw for a game with a lot of it).\n\nSpeaking as someone who has always had a fascination with Super Mario RPG, but never played through it entirely, this remake gave me my fill. I still prefer its successors; the first two Paper Marios are simply tighter, more engaging experiences. Regardless, this game is funny, quite charming, and has lots of cute metagame moments, like a boss that literally disables your attack options (novel for 1996). I do think it loses a bit in the jump to 3D; the original 2D, chunky graphics were beautiful and strange and compelling and gave rise to many memes because of it. The remake looks good but in a bland way, not blocky and puffy like the old sprites but losing a bit of their memorability. The music is of course fantastic. Yoko rarely misses.\n\nIt's a strangely unbalanced experience, in terms of pacing. Some stars are found much quicker than others, and a decent amount of the story feels like padding, albeit amusing padding. The final area(s) feel rushed and the finicky imprecise jumping controls I feel really falter here.\n\nIf it sounds like my review is a little harsher than kind, it's because I hadn't grown up with this game and I'm approaching it as an N64 kid playing it for the first time being almost in my thirties. People who played and loved the original will have plenty of fun seeing what was changed, reliving iconic moments and so on. In all honesty it's a good game, and still worth playing. All Mario RPGs, and even many RPGs in general now, borrow a lot from this game and that has to be acknowledged. It's influential for a reason; the people at Square clearly loved making this game, and that rubs off on the player. I just wish that reverence could factor into bolder gestures toward making the game fresher over 25 years later, and by not charging full price for what is nearly the same amount of game content from '96.\n\nRecommended if you like Mario, easy SNES RPGs, and big Yoshis, and especially if you like all three.",
                "10": "Not a good $ for hour ratio but that’s a toxic way to measure the joy you get from playing a game. Extremely true to the original, this remake is nothing but improvements. The only downside - it’s even easier now! And they didn’t add a hard mode, only an EVEN EASIER MODE! The easiest JRPG in history got even easier.. but it’s a romp the whole time. 10/10 would pay even more than $60 just for the updated soundtrack.\n\nPost game boss rematches are cool too. As are the in game encyclopedic features. True fans won’t miss out."
            }
        }
    }
]